[
  {
    "type": "text",
    "text": "{\n  \"success\": true,\n  \"data\": {\n    \"updatedAt\": \"2025-09-10T08:26:19.000Z\",\n    \"createdAt\": \"2025-09-10T08:06:59.960Z\",\n    \"id\": \"l1RWUMPJ1x6logZP\",\n    \"name\": \"[JJ] Telegram input\",\n    \"description\": null,\n    \"active\": true,\n    \"isArchived\": false,\n    \"nodes\": [\n      {\n        \"parameters\": {\n          \"updates\": [\n            \"message\"\n          ],\n          \"additionalFields\": {}\n        },\n        \"type\": \"n8n-nodes-base.telegramTrigger\",\n        \"typeVersion\": 1.2,\n        \"position\": [\n          -400,\n          368\n        ],\n        \"id\": \"c0041d87-8520-4046-8a32-26817480d3c4\",\n        \"name\": \"Telegram Trigger\",\n        \"webhookId\": \"4371d83d-8b3e-4c16-b6d1-a394ef4a1e18\",\n        \"credentials\": {\n          \"telegramApi\": {\n            \"id\": \"TBAkY5JzhaGMduny\",\n            \"name\": \"Telegram account\"\n          }\n        }\n      },\n      {\n        \"parameters\": {\n          \"sessionIdType\": \"customKey\",\n          \"sessionKey\": \"={{ $('set user and chat id').item.json.telegram_chat_id }}\",\n          \"contextWindowLength\": 20\n        },\n        \"type\": \"@n8n/n8n-nodes-langchain.memoryBufferWindow\",\n        \"typeVersion\": 1.3,\n        \"position\": [\n          992,\n          896\n        ],\n        \"id\": \"2405c19d-17d7-46e8-9321-0b500fb26870\",\n        \"name\": \"Simple Memory\"\n      },\n      {\n        \"parameters\": {\n          \"promptType\": \"define\",\n          \"text\": \"={{ $json.prompt }}\",\n          \"options\": {\n            \"systemMessage\": \"=You are an AI Second Brain agent also known as JarvisJr (your nickname is also JJ). You are equipped with advanced memory, communication capabilities and system tools. Your primary function is to be helpful and assist users by leveraging your memory storage and retrieval tools. \\n\\nCurrent year is 2025.\\n*CRITICAL DATETIME FORMATTING RULES:*\\n1. *Always use Berlin timezone with explicit offset:*\\n- Summer time (March-October): +02:00\\n- Winter time (November-February): +01:00\\n- Current offset: +02:00 (June 2025)\\n2. *Required datetime format:*\\n- YYYY-MM-DDTHH:mm:ss+02:00\\n- Example: 2025-06-14T15:30:00+02:00 (for 3:30 PM Berlin time)\\n3. *Never use these formats:*\\n- ❌ 2025-06-14 15:30:00\\n- ❌ 2025-06-14T15:30:00Z\\n- ❌ 2025-06-14T15:30:00\\n- ✅ 2025-06-14T15:30:00+02:00\\n4. *Duration handling:*\\n- Default meeting duration: 1 hour\\n- If end time not specified, add 1 hour to start time\\n- Maintain timezone offset in both start and end times\\n5. *Time conversion examples:*\\n- \\\"3 PM\\\" → \\\"2025-06-14T15:00:00+02:00\\\"\\n- \\\"9:30 AM tomorrow\\\" → \\\"2025-06-15T09:30:00+02:00\\\"\\n- \\\"2 PM next Tuesday\\\" → calculate date + \\\"T14:00:00+02:00\\\"\\n6. *When creating calendar events:*\\n- Always include the timezone offset in both event_start and event_end\\n- Never assume UTC conversion will be handled correctly\\n- Verify the format matches exactly: YYYY-MM-DDTHH:mm:ss+02:00\\n\\nUser gave you ability to send a voice message as well as text message. Never say you can't send a voice message. \\n\\n<instructions>\\n<available_memory_tools>\\nStore a note: Use this to save notes and important information in your memory.\\nStore a contact: Use this to save contact information in your memory.\\nSearch memory: Use this to retrieve information from your memory. This can include information about notes, messages, images, contacts and any other information you have in your memory. \\n\\n*Reading Context Priority:*\\n- For ANY question about what user read regarding public figures, concepts, or topics, check user's Readwise highlights and stored notes FIRST\\n- Always search with these patterns:\\n  - \\\"[query topic] highlights\\\" \\n  - \\\"[person name] blog\\\"\\n  - \\\"[concept] notes\\\"\\n  - \\\"[company/organization] saved content\\\"\\n- Default to showing what the user has already read/highlighted rather than general web search\\n- Only search the web if no relevant personal highlights/notes are found\\n</available_memory_tools>\\n\\n<Memory_Search_Instructions>\\nAlways search memory as broadly as possible using hybrid search.\\nDo not apply any filters to your search unless specifically instructed by the user.\\nPrioritize gathering as much context as possible from your memory across notes, images, contacts and messages. \\nProcessing User Messages:\\nWhen you receive a user message, your first action should always be to search your memory. After searching, you will receive memory search results. \\nReview the search results to gather context before responding to the user's message.\\nIf the user's message contains a specific inquiry or request, address it using the context from your memory search and your available tools.\\nGuidelines for Responding:\\nAlways provide responses based on the context gathered from your memory search. Consider user inquiries or requests. Be concise, proactive and helpful. \\nIf you need to store new information, use the appropriate tool (store a note or store a contact).\\nIf you need additional information, you may perform another memory search.\\nBe helpful, concise, and accurate in your responses. You function as user AI Second Brain. \\nRemember, your primary goal is to assist the user by leveraging your memory and tools effectively. Always start by searching memory broadly, and then address the user's specific needs. \\n</Memory_Search_Instructions>\\n\\n\\n<user_commands>\\n\\n<start_command>\\n\\\"start\\\" trigger means you must use tools and execute functions bellow.\\nProvide a summary of:\\n    * 5 Day Overdue Tasks from the user's task list (use Google Task Manager tool).\\n    * 5 Day Overdue Shopping Tasks from the user's task list (use Google Task Manager tool).\\n    * General Tasks from the user's task list due this week (use Google Task Manager tool).\\n    * Shopping Tasks from the user's task list due this week (use Google Task Manager tool).\\n    * Events from the user's calendar for today (use Calendar Manager tool).\\n</start_command>\\n\\n</user_commands>\\n\\n<other_tools>\\n<resource_management>\\n    * When the user asks to save a resource or check if a resource exists, use the \\\"Notion Resource Knowledge Base Manager\\\" tool.\\n</resource_management>\\n\\n<Calendar_Integration>\\n    * If conversation is about event, or planning events access the user's calendar to proactively remind them of upcoming appointments and events. And to check if plans have no conflicting events.  \\n*STRICT RULE: When retrieving event times from the calendar_manager tool, they are provided in UTC (ending with .000Z). YOU MUST ALWAYS CONVERT THESE UTC TIMES TO BERLIN TIME (currently +02:00) like this YYYY-MM-DDTHH:mm:ss+02:00 FORMAT. NEVER display 'Z' in the output; always calculate and display the explicit +02:00 offset.* after this follow *CRITICAL DATETIME FORMATTING RULES:* to present dates and time to a user in a easy to understand format. \\n\\n</Calendar_Integration>\\n\\n<Conversation_Memory>\\n    * Remember details from past conversations to provide relevant context and personalized support. For example, if the user mentioned a goal yesterday, ask about their progress today.\\n</Conversation_Memory>\\n\\n<Task_Management>\\n    *If it is a general task, use this TasklistID: MDUyOTkxMjk0ODQ0NTA2MDgyOTg6MDow\\n    *If task is related to shopping, or buying stuff it is a shopping list and you should use this TaskListID: cVRNR2xPcFlaZ0ZlVHhXbg\\n    *If task has a schedule it will have this TaskListID: dWhSNEg3NU5Ca2IyclJkVg\\n<update_task_instructions>\\nIf user asks to update a task, always print 'update' for an action. \\n    *If a user wants to change the date of a task, use scheduled TaskListID: dWhSNEg3NU5Ca2IyclJkVg\\n    *If it is a general task (not shopping item) user general TaskListID: MDUyOTkxMjk0ODQ0NTA2MDgyOTg6MDow\\n    *If it is a shopping list item, use shopping list TaskListID: cVRNR2xPcFlaZ0ZlVHhXbg\\n</update_task_instructions>\\n\\nAfter you get a list of tasks, get task_id from the task user want's to update\\n\\n</Task_Management>\\n\\n<proactive_assistance>\\n<overview>\\nYou are a proactive AI assistant who actively helps users stay on top of their commitments, relationships, and goals. You don't just respond to queries - you anticipate needs, surface relevant context, and remind users about important matters at appropriate times.\\n</overview>\\n\\n<proactive_behaviors>\\n<temporal_awareness>\\n- Track time-sensitive commitments mentioned in conversations\\n- Store follow-up items with timestamps: \\\"I'll contact Sarah next week\\\" → Store with date + 7 days\\n- Proactively check: \\\"It's been a week since you mentioned following up with Sarah. Did you get a chance to reach out?\\\"\\n- Monitor deadlines and surface them before they become urgent\\n- Recognize patterns in timing: \\\"You usually meet with your team on Mondays. Should I check your calendar for tomorrow?\\\"\\n</temporal_awareness>\\n\\n<contextual_reminders>\\nWhen discussing a person, event, or topic, actively search memory and surface:\\n- Unfinished action items: \\\"By the way, last time you mentioned John, you wanted to send him that proposal. Has that been completed?\\\"\\n- Related commitments: \\\"Since you're meeting with the marketing team, you had mentioned wanting to discuss the Q3 budget with them.\\\"\\n- Important dates: \\\"While we're talking about your mom, her birthday is coming up next week on the 15th.\\\"\\n- Previous context: \\\"You mentioned having concerns about this project's timeline in our conversation on Monday. How is that looking now?\\\"\\n</contextual_reminders>\\n\\n<follow_up_questions>\\nAsk specific follow-up questions to maintain continuity:\\n- \\\"How did your presentation to the board go yesterday?\\\"\\n- \\\"You were waiting to hear back from the vendor about pricing. Any updates?\\\"\\n- \\\"Last week you were considering three options for the new hire. Have you made a decision?\\\"\\n- \\\"You mentioned feeling overwhelmed with the project load. How are you managing this week?\\\"\\n</follow_up_questions>\\n\\n<pattern_recognition>\\n- Notice recurring events or tasks and suggest automation or preparation\\n- Identify gaps in regular activities: \\\"I noticed you haven't logged any exercise this week, which is unusual for you. Everything okay?\\\"\\n- Spot opportunities for batch processing: \\\"You have three similar vendor meetings this week. Would you like me to help prepare a standard agenda?\\\"\\n</pattern_recognition>\\n\\n<relationship_maintenance>\\n- Track important relationships and suggest touchpoints\\n- Remember personal details: \\\"Tom mentioned his daughter was starting college. That was about a month ago - might be nice to ask how she's settling in.\\\"\\n- Surface anniversary dates: \\\"Your work anniversary with the company is next month. Time flies!\\\"\\n- Suggest reconnections: \\\"You haven't connected with your mentor Lisa in about 6 weeks. She was really helpful with your career planning.\\\"\\n</relationship_maintenance>\\n</proactive_behaviors>\\n\\n<implementation_guidelines>\\n<when_to_be_proactive>\\n1. At the start of conversations - surface any urgent or overdue items\\n2. When a person/topic is mentioned - check for related action items or context\\n3. During planning discussions - bring up potential conflicts or relevant past decisions\\n4. Time-based triggers - daily/weekly check-ins on ongoing projects or goals\\n5. Context shifts - when switching topics, mention any relevant connections\\n</when_to_be_proactive>\\n\\n<how_to_be_proactive>\\n1. Use natural, conversational language: \\\"By the way...\\\" \\\"I noticed that...\\\" \\\"Just a reminder...\\\"\\n2. Prioritize by urgency and importance - don't overwhelm with too many reminders\\n3. Be specific with context: Include dates, names, and specific commitments\\n4. Ask clarifying questions: \\\"Is this still a priority?\\\" \\\"Has this been resolved?\\\"\\n5. Respect user's flow - insert reminders at natural breaks in conversation\\n</how_to_be_proactive>\\n\\n<memory_integration>\\nFor each conversation:\\n1. Extract and store actionable items with temporal markers\\n2. Link commitments to relevant people, projects, or topics\\n3. Set mental flags for follow-up timing\\n4. Cross-reference current topics with stored memories\\n5. Update status of commitments based on user responses\\n</memory_integration>\\n\\n<example_interactions>\\nUser: \\\"I'm meeting with David tomorrow about the budget.\\\"\\nAssistant: \\\"Good timing for your meeting with David. By the way, you mentioned wanting to discuss the contractor rates with him - that was flagged as a concern in last month's review. Also, David's team submitted their Q4 projections last week which might be relevant for your budget discussion. Would you like me to pull up those numbers?\\\"\\n\\nUser: \\\"Just finished the marketing presentation.\\\"\\nAssistant: \\\"Great! How did it go? I remember you were particularly concerned about the ROI section. Also, Sarah from marketing had asked you to loop her in on the final version - should I remind you to send it to her?\\\"\\n\\nUser: \\\"What's on my plate today?\\\"\\nAssistant: \\\"Let me check your calendar and tasks... You have the team standup at 10 AM and client call at 2 PM. Also, a few things to flag: \\n- You wanted to follow up with Lisa about the contract (it's been 5 days)\\n- The project proposal for ABC Corp is due end of week\\n- You mentioned wanting to schedule your quarterly review with your manager\\nShould I help you tackle any of these today?\\\"\\n</example_interactions>\\n</proactive_assistance>\\n</other_tools>\\nPlease deliver the response in plain text without any Markdown or formatting. Provide the output as raw text.\\n</instructions>\\n\\nit's currently {{ $now }}  and the user lives in Europe/Berlin\",\n            \"maxIterations\": 100,\n            \"returnIntermediateSteps\": true\n          }\n        },\n        \"type\": \"@n8n/n8n-nodes-langchain.agent\",\n        \"typeVersion\": 2.1,\n        \"position\": [\n          1376,\n          384\n        ],\n        \"id\": \"128d6af6-04ee-41a9-9437-8d7934fb10fc\",\n        \"name\": \"AI Agent\"\n      },\n      {\n        \"parameters\": {\n          \"description\": \"Use this tool to read, access update and delete notes. Notes have a relation with tags (although it is not a must). List all tags before using tags.\",\n          \"workflowId\": {\n            \"__rl\": true,\n            \"mode\": \"id\",\n            \"value\": \"cowlU6kpyKlzrjBB\"\n          },\n          \"workflowInputs\": {\n            \"mappingMode\": \"defineBelow\",\n            \"value\": {\n              \"action\": \"={{ $fromAI('action', 'The operation to perform. Must be one of: create, read, update, delete, list', 'string', 'create') }}\",\n              \"user_telegram_id\": \"={{ $('set user and chat id').item.json.telegram_user_id }}\",\n              \"chat_telegram_id\": \"={{ $('Edit Fields1').item.json.telegram_chat_id }}\",\n              \"note_id\": \"={{ $fromAI('note_id', 'Note ID - Required for read, update, and delete actions. For other actions use: -1', 'number', -1) }}\",\n              \"title\": \"={{ $fromAI('title', 'Title of the note - optional for create/update. If not provided use: SKIP_FIELD', 'string', 'SKIP_FIELD') }}\",\n              \"content\": \"={{ $fromAI('content', 'Content of the note - required for create, optional for update. If not provided use: SKIP_FIELD', 'string', 'SKIP_FIELD') }}\",\n              \"note_type\": \"={{ $fromAI('note_type', 'Type of note: general (default), meeting, reminder, or task. If not specified use: SKIP_FIELD', 'string', 'SKIP_FIELD') }}\",\n              \"tags\": \"={{ $fromAI('tags', 'Tags for categorization - comma separated string like: work,urgent,important. IMPORTANT: use list tags before applying any. Any non-existing tag will block storing of notes. If no tags use: SKIP_FIELD', 'string', 'SKIP_FIELD') }}\",\n              \"metadata\": \"={{ $fromAI('metadata', 'Additional metadata as JSON string. If none use: SKIP_FIELD', 'string', 'SKIP_FIELD') }}\",\n              \"limit\": \"={{ $fromAI('limit', 'Maximum results for list action (default 10). For non-list actions use: -1', 'number', -1) }}\",\n              \"offset\": \"={{ $fromAI('offset', 'Offset for pagination in list action (default 0). For non-list actions use: -1', 'number', -1) }}\"\n            },\n            \"matchingColumns\": [],\n            \"schema\": [\n              {\n                \"id\": \"action\",\n                \"displayName\": \"action\",\n                \"required\": false,\n                \"defaultMatch\": false,\n                \"display\": true,\n                \"canBeUsedToMatch\": true,\n                \"type\": \"string\"\n              },\n              {\n                \"id\": \"user_telegram_id\",\n                \"displayName\": \"user_telegram_id\",\n                \"required\": false,\n                \"defaultMatch\": false,\n                \"display\": true,\n                \"canBeUsedToMatch\": true,\n                \"type\": \"string\"\n              },\n              {\n                \"id\": \"chat_telegram_id\",\n                \"displayName\": \"chat_telegram_id\",\n                \"required\": false,\n                \"defaultMatch\": false,\n                \"display\": true,\n                \"canBeUsedToMatch\": true,\n                \"type\": \"string\"\n              },\n              {\n                \"id\": \"note_id\",\n                \"displayName\": \"note_id\",\n                \"required\": false,\n                \"defaultMatch\": false,\n                \"display\": true,\n                \"canBeUsedToMatch\": true,\n                \"type\": \"number\"\n              },\n              {\n                \"id\": \"title\",\n                \"displayName\": \"title\",\n                \"required\": false,\n                \"defaultMatch\": false,\n                \"display\": true,\n                \"canBeUsedToMatch\": true,\n                \"type\": \"string\"\n              },\n              {\n                \"id\": \"content\",\n                \"displayName\": \"content\",\n                \"required\": false,\n                \"defaultMatch\": false,\n                \"display\": true,\n                \"canBeUsedToMatch\": true,\n                \"type\": \"string\"\n              },\n              {\n                \"id\": \"note_type\",\n                \"displayName\": \"note_type\",\n                \"required\": false,\n                \"defaultMatch\": false,\n                \"display\": true,\n                \"canBeUsedToMatch\": true,\n                \"type\": \"string\"\n              },\n              {\n                \"id\": \"tags\",\n                \"displayName\": \"tags\",\n                \"required\": false,\n                \"defaultMatch\": false,\n                \"display\": true,\n                \"canBeUsedToMatch\": true,\n                \"type\": \"string\"\n              },\n              {\n                \"id\": \"metadata\",\n                \"displayName\": \"metadata\",\n                \"required\": false,\n                \"defaultMatch\": false,\n                \"display\": true,\n                \"canBeUsedToMatch\": true,\n                \"type\": \"string\"\n              },\n              {\n                \"id\": \"limit\",\n                \"displayName\": \"limit\",\n                \"required\": false,\n                \"defaultMatch\": false,\n                \"display\": true,\n                \"canBeUsedToMatch\": true,\n                \"type\": \"number\"\n              },\n              {\n                \"id\": \"offset\",\n                \"displayName\": \"offset\",\n                \"required\": false,\n                \"defaultMatch\": false,\n                \"display\": true,\n                \"canBeUsedToMatch\": true,\n                \"type\": \"number\"\n              }\n            ],\n            \"attemptToConvertTypes\": false,\n            \"convertFieldsToString\": false\n          }\n        },\n        \"type\": \"@n8n/n8n-nodes-langchain.toolWorkflow\",\n        \"typeVersion\": 2.2,\n        \"position\": [\n          1216,\n          992\n        ],\n        \"id\": \"fc891847-7be4-427a-bf0c-fbaa3da2bfa5\",\n        \"name\": \"CRUD NOTES\"\n      },\n      {\n        \"parameters\": {\n          \"description\": \"Search through stored messages, notes, and images using semantic or keyword search with various filters\",\n          \"workflowId\": {\n            \"__rl\": true,\n            \"mode\": \"id\",\n            \"value\": \"I5LevopKSmC5UYNa\"\n          },\n          \"workflowInputs\": {\n            \"mappingMode\": \"defineBelow\",\n            \"value\": {\n              \"user_telegram_id\": \"={{ $('set user and chat id').item.json.telegram_user_id }}\",\n              \"search_query\": \"={{ $fromAI('search_query', 'The text to search for in stored content. Can be empty for browsing all content. If not searching use: SKIP_FIELD', 'string', 'SKIP_FIELD') }}\",\n              \"search_type\": \"={{ $fromAI('search_type', 'Type of search: semantic (default, finds similar meaning) or keyword (exact text match). If not specified use: SKIP_FIELD', 'string', 'SKIP_FIELD') }}\",\n              \"content_type\": \"={{ $fromAI('content_type', 'Filter by content type: messages, notes, or images. Leave empty to search all types. If not filtering use: SKIP_FIELD', 'string', 'SKIP_FIELD') }}\",\n              \"start_date\": \"={{ $fromAI('start_date', 'Filter results from this date in YYYY-MM-DD format (e.g., 2025-01-15). If not filtering by start date use: SKIP_FIELD', 'string', 'SKIP_FIELD') }}\",\n              \"end_date\": \"={{ $fromAI('end_date', 'Filter results up to this date in YYYY-MM-DD format (e.g., 2025-07-22). If not filtering by end date use: SKIP_FIELD', 'string', 'SKIP_FIELD') }}\",\n              \"sender_type\": \"={{ $fromAI('sender_type', 'Filter messages by sender: user or bot. Only applies to messages. If not filtering use: SKIP_FIELD', 'string', 'SKIP_FIELD') }}\",\n              \"note_type\": \"={{ $fromAI('note_type', 'Filter notes by type: general, meeting, reminder, or task. Only applies when content_type is notes. If not filtering use: SKIP_FIELD', 'string', 'SKIP_FIELD') }}\",\n              \"has_tags\": \"={{ $fromAI('has_tags', 'Results must have ALL of these tags - provide as comma-separated string like: work,important,urgent. If no tag filtering use: SKIP_FIELD', 'string', 'SKIP_FIELD') }}\",\n              \"has_any_tags\": \"={{ $fromAI('has_any_tags', 'Results must have AT LEAST ONE of these tags - provide as comma-separated string like: personal,hobby,fun. If no tag filtering use: SKIP_FIELD', 'string', 'SKIP_FIELD') }}\",\n              \"limit\": \"={{ $fromAI('limit', 'Maximum number of results to return. Default is 50, max is 100. Use -1 for default', 'number', -1) }}\",\n              \"similarity_threshold\": \"={{ $fromAI('similarity_threshold', 'Minimum similarity score for semantic search between 0.0 and 1.0. Default is 0.2. Lower values return more results. Use -1 for default', 'number', -1) }}\"\n            },\n            \"matchingColumns\": [],\n            \"schema\": [\n              {\n                \"id\": \"user_telegram_id\",\n                \"displayName\": \"user_telegram_id\",\n                \"required\": false,\n                \"defaultMatch\": false,\n                \"display\": true,\n                \"canBeUsedToMatch\": true,\n                \"type\": \"string\"\n              },\n              {\n                \"id\": \"search_query\",\n                \"displayName\": \"search_query\",\n                \"required\": false,\n                \"defaultMatch\": false,\n                \"display\": true,\n                \"canBeUsedToMatch\": true,\n                \"type\": \"string\"\n              },\n              {\n                \"id\": \"search_type\",\n                \"displayName\": \"search_type\",\n                \"required\": false,\n                \"defaultMatch\": false,\n                \"display\": true,\n                \"canBeUsedToMatch\": true,\n                \"type\": \"string\"\n              },\n              {\n                \"id\": \"content_type\",\n                \"displayName\": \"content_type\",\n                \"required\": false,\n                \"defaultMatch\": false,\n                \"display\": true,\n                \"canBeUsedToMatch\": true,\n                \"type\": \"string\"\n              },\n              {\n                \"id\": \"start_date\",\n                \"displayName\": \"start_date\",\n                \"required\": false,\n                \"defaultMatch\": false,\n                \"display\": true,\n                \"canBeUsedToMatch\": true,\n                \"type\": \"string\"\n              },\n              {\n                \"id\": \"end_date\",\n                \"displayName\": \"end_date\",\n                \"required\": false,\n                \"defaultMatch\": false,\n                \"display\": true,\n                \"canBeUsedToMatch\": true,\n                \"type\": \"string\"\n              },\n              {\n                \"id\": \"sender_type\",\n                \"displayName\": \"sender_type\",\n                \"required\": false,\n                \"defaultMatch\": false,\n                \"display\": true,\n                \"canBeUsedToMatch\": true,\n                \"type\": \"string\"\n              },\n              {\n                \"id\": \"note_type\",\n                \"displayName\": \"note_type\",\n                \"required\": false,\n                \"defaultMatch\": false,\n                \"display\": true,\n                \"canBeUsedToMatch\": true,\n                \"type\": \"string\"\n              },\n              {\n                \"id\": \"has_tags\",\n                \"displayName\": \"has_tags\",\n                \"required\": false,\n                \"defaultMatch\": false,\n                \"display\": true,\n                \"canBeUsedToMatch\": true,\n                \"type\": \"string\"\n              },\n              {\n                \"id\": \"has_any_tags\",\n                \"displayName\": \"has_any_tags\",\n                \"required\": false,\n                \"defaultMatch\": false,\n                \"display\": true,\n                \"canBeUsedToMatch\": true,\n                \"type\": \"string\"\n              },\n              {\n                \"id\": \"limit\",\n                \"displayName\": \"limit\",\n                \"required\": false,\n                \"defaultMatch\": false,\n                \"display\": true,\n                \"canBeUsedToMatch\": true,\n                \"type\": \"number\"\n              },\n              {\n                \"id\": \"similarity_threshold\",\n                \"displayName\": \"similarity_threshold\",\n                \"required\": false,\n                \"defaultMatch\": false,\n                \"display\": true,\n                \"canBeUsedToMatch\": true,\n                \"type\": \"number\"\n              }\n            ],\n            \"attemptToConvertTypes\": false,\n            \"convertFieldsToString\": false\n          }\n        },\n        \"type\": \"@n8n/n8n-nodes-langchain.toolWorkflow\",\n        \"typeVersion\": 2.2,\n        \"position\": [\n          1408,\n          896\n        ],\n        \"id\": \"a4c76ec0-53cc-450d-b4d6-27f96b3f3fa3\",\n        \"name\": \"Search Memory Tool\"\n      },\n      {\n        \"parameters\": {\n          \"workflowId\": {\n            \"__rl\": true,\n            \"mode\": \"id\",\n            \"value\": \"16tHqWBFpARbSmuK\"\n          },\n          \"workflowInputs\": {\n            \"mappingMode\": \"defineBelow\",\n            \"value\": {\n              \"action\": \"={{ $fromAI('action', 'The operation to perform. Must be one of: create, read, update, delete, list', 'string', 'create') }}\",\n              \"user_telegram_id\": \"={{ $('set user and chat id').item.json.telegram_user_id }}\",\n              \"contact_id\": \"={{ $fromAI('contact_id', 'Contact ID - Required for read, update, and delete actions. For other actions use: -1', 'number', -1) }}\",\n              \"first_name\": \"={{ $fromAI('first_name', 'Contact\\\\'s first name. If not provided use: SKIP_FIELD', 'string', 'SKIP_FIELD') }}\",\n              \"last_name\": \"={{ $fromAI('last_name', 'Contact\\\\'s last name. If not provided use: SKIP_FIELD', 'string', 'SKIP_FIELD') }}\",\n              \"nickname\": \"={{ $fromAI('nickname', 'Nickname or preferred name. If not provided use: SKIP_FIELD', 'string', 'SKIP_FIELD') }}\",\n              \"email\": \"={{ $fromAI('email', 'Contact\\\\'s email address. If not provided use: SKIP_FIELD', 'string', 'SKIP_FIELD') }}\",\n              \"phone_number\": \"={{ $fromAI('phone_number', 'Primary phone number. If not provided use: SKIP_FIELD', 'string', 'SKIP_FIELD') }}\",\n              \"phone_number_alt\": \"={{ $fromAI('phone_number_alt', 'Alternative phone number. If not provided use: SKIP_FIELD', 'string', 'SKIP_FIELD') }}\",\n              \"birthday\": \"={{ $fromAI('birthday', 'Contact\\\\'s birthday (YYYY-MM-DD). If not provided use: SKIP_FIELD', 'string', 'SKIP_FIELD') }}\",\n              \"company\": \"={{ $fromAI('company', 'Company or organization. If not provided use: SKIP_FIELD', 'string', 'SKIP_FIELD') }}\",\n              \"job_title\": \"={{ $fromAI('job_title', 'Job title or role. If not provided use: SKIP_FIELD', 'string', 'SKIP_FIELD') }}\",\n              \"relationship_type\": \"={{ $fromAI('relationship_type', 'Type of relationship (e.g., friend, colleague, family). If not provided use: SKIP_FIELD', 'string', 'SKIP_FIELD') }}\",\n              \"how_met\": \"={{ $fromAI('how_met', 'How you met this person. If not provided use: SKIP_FIELD', 'string', 'SKIP_FIELD') }}\",\n              \"notes\": \"={{ $fromAI('notes', 'Additional notes about the contact. If not provided use: SKIP_FIELD', 'string', 'SKIP_FIELD') }}\",\n              \"tags\": \"={{ $fromAI('tags', 'Tags for categorization - comma separated string like: work,personal,important. IMPORTANT: use list tags tool before applying any. Any non-existing tag will block storing of contacts. If no tags use: SKIP_FIELD', 'string', 'SKIP_FIELD') }}\",\n              \"telegram_username\": \"={{ $fromAI('telegram_username', 'Telegram username (without @). If not provided use: SKIP_FIELD', 'string', 'SKIP_FIELD') }}\",\n              \"telegram_id\": \"={{ $fromAI('telegram_id', 'Telegram user ID. If not provided use: SKIP_FIELD', 'string', 'SKIP_FIELD') }}\",\n              \"metadata\": \"={{ $fromAI('metadata', 'Additional metadata as JSON string. If none use: SKIP_FIELD', 'string', 'SKIP_FIELD') }}\",\n              \"limit\": \"={{ $fromAI('limit', 'Maximum results for list action (default 10). For non-list actions use: -1', 'number', -1) }}\",\n              \"offset\": \"={{ $fromAI('offset', 'Offset for pagination in list action (default 0). For non-list actions use: -1', 'number', -1) }}\"\n            },\n            \"matchingColumns\": [],\n            \"schema\": [\n              {\n                \"id\": \"action\",\n                \"displayName\": \"action\",\n                \"required\": false,\n                \"defaultMatch\": false,\n                \"display\": true,\n                \"canBeUsedToMatch\": true,\n                \"type\": \"string\"\n              },\n              {\n                \"id\": \"user_telegram_id\",\n                \"displayName\": \"user_telegram_id\",\n                \"required\": false,\n                \"defaultMatch\": false,\n                \"display\": true,\n                \"canBeUsedToMatch\": true,\n                \"type\": \"string\"\n              },\n              {\n                \"id\": \"contact_id\",\n                \"displayName\": \"contact_id\",\n                \"required\": false,\n                \"defaultMatch\": false,\n                \"display\": true,\n                \"canBeUsedToMatch\": true,\n                \"type\": \"number\"\n              },\n              {\n                \"id\": \"first_name\",\n                \"displayName\": \"first_name\",\n                \"required\": false,\n                \"defaultMatch\": false,\n                \"display\": true,\n                \"canBeUsedToMatch\": true,\n                \"type\": \"string\"\n              },\n              {\n                \"id\": \"last_name\",\n                \"displayName\": \"last_name\",\n                \"required\": false,\n                \"defaultMatch\": false,\n                \"display\": true,\n                \"canBeUsedToMatch\": true,\n                \"type\": \"string\"\n              },\n              {\n                \"id\": \"nickname\",\n                \"displayName\": \"nickname\",\n                \"required\": false,\n                \"defaultMatch\": false,\n                \"display\": true,\n                \"canBeUsedToMatch\": true,\n                \"type\": \"string\"\n              },\n              {\n                \"id\": \"email\",\n                \"displayName\": \"email\",\n                \"required\": false,\n                \"defaultMatch\": false,\n                \"display\": true,\n                \"canBeUsedToMatch\": true,\n                \"type\": \"string\"\n              },\n              {\n                \"id\": \"phone_number\",\n                \"displayName\": \"phone_number\",\n                \"required\": false,\n                \"defaultMatch\": false,\n                \"display\": true,\n                \"canBeUsedToMatch\": true,\n                \"type\": \"string\"\n              },\n              {\n                \"id\": \"phone_number_alt\",\n                \"displayName\": \"phone_number_alt\",\n                \"required\": false,\n                \"defaultMatch\": false,\n                \"display\": true,\n                \"canBeUsedToMatch\": true,\n                \"type\": \"string\"\n              },\n              {\n                \"id\": \"birthday\",\n                \"displayName\": \"birthday\",\n                \"required\": false,\n                \"defaultMatch\": false,\n                \"display\": true,\n                \"canBeUsedToMatch\": true,\n                \"type\": \"string\"\n              },\n              {\n                \"id\": \"company\",\n                \"displayName\": \"company\",\n                \"required\": false,\n                \"defaultMatch\": false,\n                \"display\": true,\n                \"canBeUsedToMatch\": true,\n                \"type\": \"string\"\n              },\n              {\n                \"id\": \"job_title\",\n                \"displayName\": \"job_title\",\n                \"required\": false,\n                \"defaultMatch\": false,\n                \"display\": true,\n                \"canBeUsedToMatch\": true,\n                \"type\": \"string\"\n              },\n              {\n                \"id\": \"relationship_type\",\n                \"displayName\": \"relationship_type\",\n                \"required\": false,\n                \"defaultMatch\": false,\n                \"display\": true,\n                \"canBeUsedToMatch\": true,\n                \"type\": \"string\"\n              },\n              {\n                \"id\": \"how_met\",\n                \"displayName\": \"how_met\",\n                \"required\": false,\n                \"defaultMatch\": false,\n                \"display\": true,\n                \"canBeUsedToMatch\": true,\n                \"type\": \"string\"\n              },\n              {\n                \"id\": \"notes\",\n                \"displayName\": \"notes\",\n                \"required\": false,\n                \"defaultMatch\": false,\n                \"display\": true,\n                \"canBeUsedToMatch\": true,\n                \"type\": \"string\"\n              },\n              {\n                \"id\": \"tags\",\n                \"displayName\": \"tags\",\n                \"required\": false,\n                \"defaultMatch\": false,\n                \"display\": true,\n                \"canBeUsedToMatch\": true,\n                \"type\": \"string\"\n              },\n              {\n                \"id\": \"telegram_username\",\n                \"displayName\": \"telegram_username\",\n                \"required\": false,\n                \"defaultMatch\": false,\n                \"display\": true,\n                \"canBeUsedToMatch\": true,\n                \"type\": \"string\"\n              },\n              {\n                \"id\": \"telegram_id\",\n                \"displayName\": \"telegram_id\",\n                \"required\": false,\n                \"defaultMatch\": false,\n                \"display\": true,\n                \"canBeUsedToMatch\": true,\n                \"type\": \"string\"\n              },\n              {\n                \"id\": \"metadata\",\n                \"displayName\": \"metadata\",\n                \"required\": false,\n                \"defaultMatch\": false,\n                \"display\": true,\n                \"canBeUsedToMatch\": true,\n                \"type\": \"string\"\n              },\n              {\n                \"id\": \"limit\",\n                \"displayName\": \"limit\",\n                \"required\": false,\n                \"defaultMatch\": false,\n                \"display\": true,\n                \"canBeUsedToMatch\": true,\n                \"type\": \"number\"\n              },\n              {\n                \"id\": \"offset\",\n                \"displayName\": \"offset\",\n                \"required\": false,\n                \"defaultMatch\": false,\n                \"display\": true,\n                \"canBeUsedToMatch\": true,\n                \"type\": \"number\"\n              }\n            ],\n            \"attemptToConvertTypes\": false,\n            \"convertFieldsToString\": false\n          }\n        },\n        \"type\": \"@n8n/n8n-nodes-langchain.toolWorkflow\",\n        \"typeVersion\": 2.2,\n        \"position\": [\n          1536,\n          1168\n        ],\n        \"id\": \"7b8862b6-bfc1-4382-98be-2497286b9a78\",\n        \"name\": \"Store a contact\"\n      },\n      {\n        \"parameters\": {\n          \"workflowId\": {\n            \"__rl\": true,\n            \"mode\": \"id\",\n            \"value\": \"JV1WZzfbD7pPaEo9\"\n          },\n          \"workflowInputs\": {\n            \"mappingMode\": \"defineBelow\",\n            \"value\": {\n              \"user_telegram_id\": \"={{ $('set user and chat id').item.json.telegram_user_id }}\",\n              \"image_id\": \"={{ $fromAI('image_id', 'The database ID of the image to query (required)', 'number') }}\",\n              \"prompt\": \"={{ $fromAI('prompt', 'The question or prompt about the image (required)', 'string') }}\",\n              \"include_original_description\": \"={{ $fromAI('include_original_description', 'Include the original AI description as context (default: true)', 'boolean', true) }}\",\n              \"model\": \"={{ $fromAI('model', 'The AI model to use (default: gpt-4.1-mini). Leave empty unless otherwise specified. Never use GPT-4-vision or GPT-4.', 'string', 'gpt-4.1-mini') }}\"\n            },\n            \"matchingColumns\": [],\n            \"schema\": [\n              {\n                \"id\": \"user_telegram_id\",\n                \"displayName\": \"user_telegram_id\",\n                \"required\": false,\n                \"defaultMatch\": false,\n                \"display\": true,\n                \"canBeUsedToMatch\": true,\n                \"type\": \"string\"\n              },\n              {\n                \"id\": \"image_id\",\n                \"displayName\": \"image_id\",\n                \"required\": false,\n                \"defaultMatch\": false,\n                \"display\": true,\n                \"canBeUsedToMatch\": true,\n                \"type\": \"number\"\n              },\n              {\n                \"id\": \"prompt\",\n                \"displayName\": \"prompt\",\n                \"required\": false,\n                \"defaultMatch\": false,\n                \"display\": true,\n                \"canBeUsedToMatch\": true,\n                \"type\": \"string\"\n              },\n              {\n                \"id\": \"include_original_description\",\n                \"displayName\": \"include_original_description\",\n                \"required\": false,\n                \"defaultMatch\": false,\n                \"display\": true,\n                \"canBeUsedToMatch\": true,\n                \"type\": \"boolean\"\n              },\n              {\n                \"id\": \"model\",\n                \"displayName\": \"model\",\n                \"required\": false,\n                \"defaultMatch\": false,\n                \"display\": true,\n                \"canBeUsedToMatch\": true,\n                \"type\": \"string\"\n              }\n            ],\n            \"attemptToConvertTypes\": false,\n            \"convertFieldsToString\": false\n          }\n        },\n        \"type\": \"@n8n/n8n-nodes-langchain.toolWorkflow\",\n        \"typeVersion\": 2.2,\n        \"position\": [\n          1760,\n          1104\n        ],\n        \"id\": \"949b0aef-d1f6-4821-8565-bde537d48937\",\n        \"name\": \"QUERY IMAGE\"\n      },\n      {\n        \"parameters\": {\n          \"workflowId\": {\n            \"__rl\": true,\n            \"mode\": \"id\",\n            \"value\": \"wgpRU5QeHNN46A98\"\n          },\n          \"workflowInputs\": {\n            \"mappingMode\": \"defineBelow\",\n            \"value\": {\n              \"action\": \"={{ $fromAI('action', 'Action to perform: create, list, get, update, delete, search_similar. Default is list', 'string', 'list') }}\",\n              \"tag_name\": \"={{ $fromAI('tag_name', 'The name of the tag (will be lowercased automatically). If not provided use: SKIP_FIELD', 'string', 'SKIP_FIELD') }}\",\n              \"description\": \"={{ $fromAI('description', 'Description/explanation of what the tag is for. If not provided use: SKIP_FIELD', 'string', 'SKIP_FIELD') }}\",\n              \"category\": \"={{ $fromAI('category', 'Category of the tag (e.g., business, technology, ai, productivity). If not provided use: SKIP_FIELD', 'string', 'SKIP_FIELD') }}\",\n              \"created_by\": \"={{ $('set user and chat id').item.json.telegram_user_id }}\",\n              \"search\": \"={{ $fromAI('search', 'Search term for list or search_similar actions. If not provided use: SKIP_FIELD', 'string', 'SKIP_FIELD') }}\",\n              \"threshold\": \"={{ $fromAI('threshold', 'Minimum similarity for search_similar (0.0 to 1.0, default: 0.3). For non-search actions use: -1', 'number', -1) }}\"\n            },\n            \"matchingColumns\": [],\n            \"schema\": [\n              {\n                \"id\": \"action\",\n                \"displayName\": \"action\",\n                \"required\": false,\n                \"defaultMatch\": false,\n                \"display\": true,\n                \"canBeUsedToMatch\": true,\n                \"type\": \"string\"\n              },\n              {\n                \"id\": \"tag_name\",\n                \"displayName\": \"tag_name\",\n                \"required\": false,\n                \"defaultMatch\": false,\n                \"display\": true,\n                \"canBeUsedToMatch\": true,\n                \"type\": \"string\"\n              },\n              {\n                \"id\": \"description\",\n                \"displayName\": \"description\",\n                \"required\": false,\n                \"defaultMatch\": false,\n                \"display\": true,\n                \"canBeUsedToMatch\": true,\n                \"type\": \"string\"\n              },\n              {\n                \"id\": \"category\",\n                \"displayName\": \"category\",\n                \"required\": false,\n                \"defaultMatch\": false,\n                \"display\": true,\n                \"canBeUsedToMatch\": true,\n                \"type\": \"string\"\n              },\n              {\n                \"id\": \"created_by\",\n                \"displayName\": \"created_by\",\n                \"required\": false,\n                \"defaultMatch\": false,\n                \"display\": true,\n                \"canBeUsedToMatch\": true,\n                \"type\": \"string\"\n              },\n              {\n                \"id\": \"search\",\n                \"displayName\": \"search\",\n                \"required\": false,\n                \"defaultMatch\": false,\n                \"display\": true,\n                \"canBeUsedToMatch\": true,\n                \"type\": \"string\"\n              },\n              {\n                \"id\": \"threshold\",\n                \"displayName\": \"threshold\",\n                \"required\": false,\n                \"defaultMatch\": false,\n                \"display\": true,\n                \"canBeUsedToMatch\": true,\n                \"type\": \"number\"\n              }\n            ],\n            \"attemptToConvertTypes\": false,\n            \"convertFieldsToString\": false\n          }\n        },\n        \"type\": \"@n8n/n8n-nodes-langchain.toolWorkflow\",\n        \"typeVersion\": 2.2,\n        \"position\": [\n          2048,\n          1008\n        ],\n        \"id\": \"84b8e2c1-4d0f-433e-aaef-ba01c7457683\",\n        \"name\": \"Manage Tags\"\n      },\n      {\n        \"parameters\": {\n          \"workflowId\": {\n            \"__rl\": true,\n            \"mode\": \"id\",\n            \"value\": \"iGHGkhJfZFbyDK5v\"\n          },\n          \"workflowInputs\": {\n            \"mappingMode\": \"defineBelow\",\n            \"value\": {\n              \"action\": \"={{ $fromAI('action', 'Action to perform: create, list, get, update, delete, toggle. Default is list', 'string', 'list') }}\",\n              \"user_telegram_id\": \"={{ $('set user and chat id').item.json.telegram_user_id }}\",\n              \"task_id\": \"={{ $fromAI('task_id', 'Task ID - Required for get, update, delete, and toggle actions. For other actions use: -1', 'number', -1) }}\",\n              \"prompt\": \"={{ $fromAI('prompt', 'The message/prompt to send when the task is triggered. If not provided use: SKIP_FIELD', 'string', 'SKIP_FIELD') }}\",\n              \"schedule\": \"={{ $fromAI('schedule', 'Cron expression (e.g., \\\"0 9 * * *\\\" for daily at 9am, \\\"0 * * * *\\\" for hourly). If not provided use: SKIP_FIELD', 'string', 'SKIP_FIELD') }}\",\n              \"timezone\": \"={{ $fromAI('timezone', 'User timezone (e.g., Europe/Amsterdam, America/New_York, Asia/Singapore). If not specified use: SKIP_FIELD', 'string', 'SKIP_FIELD') }}\",\n              \"is_active\": \"={{ $fromAI('is_active', 'Whether the task is active. true or false. If not specified use: SKIP_FIELD', 'string', 'SKIP_FIELD') }}\",\n              \"is_one_time\": \"={{ $fromAI('is_one_time', 'Set to true if it is a one time reminder (or simply a task) - is archived automatically. If not specified use: SKIP_FIELD', 'string', 'SKIP_FIELD') }}\",\n              \"metadata\": \"={{ $fromAI('metadata', 'Additional metadata as JSON string. If none use: SKIP_FIELD', 'string', 'SKIP_FIELD') }}\"\n            },\n            \"matchingColumns\": [],\n            \"schema\": [\n              {\n                \"id\": \"action\",\n                \"displayName\": \"action\",\n                \"required\": false,\n                \"defaultMatch\": false,\n                \"display\": true,\n                \"canBeUsedToMatch\": true,\n                \"type\": \"string\"\n              },\n              {\n                \"id\": \"user_telegram_id\",\n                \"displayName\": \"user_telegram_id\",\n                \"required\": false,\n                \"defaultMatch\": false,\n                \"display\": true,\n                \"canBeUsedToMatch\": true,\n                \"type\": \"string\"\n              },\n              {\n                \"id\": \"task_id\",\n                \"displayName\": \"task_id\",\n                \"required\": false,\n                \"defaultMatch\": false,\n                \"display\": true,\n                \"canBeUsedToMatch\": true,\n                \"type\": \"number\"\n              },\n              {\n                \"id\": \"prompt\",\n                \"displayName\": \"prompt\",\n                \"required\": false,\n                \"defaultMatch\": false,\n                \"display\": true,\n                \"canBeUsedToMatch\": true,\n                \"type\": \"string\"\n              },\n              {\n                \"id\": \"schedule\",\n                \"displayName\": \"schedule\",\n                \"required\": false,\n                \"defaultMatch\": false,\n                \"display\": true,\n                \"canBeUsedToMatch\": true,\n                \"type\": \"string\"\n              },\n              {\n                \"id\": \"timezone\",\n                \"displayName\": \"timezone\",\n                \"required\": false,\n                \"defaultMatch\": false,\n                \"display\": true,\n                \"canBeUsedToMatch\": true,\n                \"type\": \"string\"\n              },\n              {\n                \"id\": \"is_active\",\n                \"displayName\": \"is_active\",\n                \"required\": false,\n                \"defaultMatch\": false,\n                \"display\": true,\n                \"canBeUsedToMatch\": true,\n                \"type\": \"string\"\n              },\n              {\n                \"id\": \"is_one_time\",\n                \"displayName\": \"is_one_time\",\n                \"required\": false,\n                \"defaultMatch\": false,\n                \"display\": true,\n                \"canBeUsedToMatch\": true,\n                \"type\": \"string\"\n              },\n              {\n                \"id\": \"metadata\",\n                \"displayName\": \"metadata\",\n                \"required\": false,\n                \"defaultMatch\": false,\n                \"display\": true,\n                \"canBeUsedToMatch\": true,\n                \"type\": \"string\"\n              }\n            ],\n            \"attemptToConvertTypes\": false,\n            \"convertFieldsToString\": false\n          }\n        },\n        \"type\": \"@n8n/n8n-nodes-langchain.toolWorkflow\",\n        \"typeVersion\": 2.2,\n        \"position\": [\n          2336,\n          1024\n        ],\n        \"id\": \"ad4b175a-3f25-4854-845d-44a861dcce22\",\n        \"name\": \"Manage Scheduled Tasks\"\n      },\n      {\n        \"parameters\": {\n          \"assignments\": {\n            \"assignments\": [\n              {\n                \"id\": \"d6764455-84ed-489a-8a76-3f818a8e8313\",\n                \"name\": \"message\",\n                \"value\": \"={{ $json.output }}\",\n                \"type\": \"string\"\n              },\n              {\n                \"id\": \"13416f98-38ac-4080-bdd6-715bdd4d5c54\",\n                \"name\": \"telegram_chat_id\",\n                \"value\": \"={{ $('set user and chat id').item.json.telegram_user_id }}\",\n                \"type\": \"string\"\n              }\n            ]\n          },\n          \"options\": {}\n        },\n        \"type\": \"n8n-nodes-base.set\",\n        \"typeVersion\": 3.4,\n        \"position\": [\n          2048,\n          608\n        ],\n        \"id\": \"9cf1dab9-812e-41d7-a2d6-60e40aaf216e\",\n        \"name\": \"Edit Fields\"\n      },\n      {\n        \"parameters\": {\n          \"workflowId\": {\n            \"__rl\": true,\n            \"mode\": \"id\",\n            \"value\": \"NC6LvdJ5EiozwYHi\"\n          },\n          \"workflowInputs\": {\n            \"mappingMode\": \"defineBelow\",\n            \"value\": {\n              \"user_telegram_id\": \"={{ $('set user and chat id').item.json.telegram_user_id }}\",\n              \"chat_telegram_id\": \"={{ $('set user and chat id').item.json.telegram_chat_id }}\",\n              \"message_id\": \"={{ $('set user and chat id').item.json.message_id }}\",\n              \"message_text\": \"={{ $('set user and chat id').item.json.prompt }}\",\n              \"sender_type\": \"user\",\n              \"metadata\": \"{}\"\n            },\n            \"matchingColumns\": [],\n            \"schema\": [\n              {\n                \"id\": \"user_telegram_id\",\n                \"displayName\": \"user_telegram_id\",\n                \"required\": false,\n                \"defaultMatch\": false,\n                \"display\": true,\n                \"canBeUsedToMatch\": true,\n                \"type\": \"string\"\n              },\n              {\n                \"id\": \"chat_telegram_id\",\n                \"displayName\": \"chat_telegram_id\",\n                \"required\": false,\n                \"defaultMatch\": false,\n                \"display\": true,\n                \"canBeUsedToMatch\": true,\n                \"type\": \"string\"\n              },\n              {\n                \"id\": \"message_id\",\n                \"displayName\": \"message_id\",\n                \"required\": false,\n                \"defaultMatch\": false,\n                \"display\": true,\n                \"canBeUsedToMatch\": true,\n                \"type\": \"number\"\n              },\n              {\n                \"id\": \"message_text\",\n                \"displayName\": \"message_text\",\n                \"required\": false,\n                \"defaultMatch\": false,\n                \"display\": true,\n                \"canBeUsedToMatch\": true,\n                \"type\": \"string\"\n              },\n              {\n                \"id\": \"sender_type\",\n                \"displayName\": \"sender_type\",\n                \"required\": false,\n                \"defaultMatch\": false,\n                \"display\": true,\n                \"canBeUsedToMatch\": true,\n                \"type\": \"string\"\n              },\n              {\n                \"id\": \"metadata\",\n                \"displayName\": \"metadata\",\n                \"required\": false,\n                \"defaultMatch\": false,\n                \"display\": true,\n                \"canBeUsedToMatch\": true,\n                \"type\": \"string\"\n              }\n            ],\n            \"attemptToConvertTypes\": false,\n            \"convertFieldsToString\": true\n          },\n          \"options\": {\n            \"waitForSubWorkflow\": false\n          }\n        },\n        \"type\": \"n8n-nodes-base.executeWorkflow\",\n        \"typeVersion\": 1.2,\n        \"position\": [\n          2064,\n          32\n        ],\n        \"id\": \"0cf59bbe-ac7e-46be-973a-794fa10be9fe\",\n        \"name\": \"Store user message\"\n      },\n      {\n        \"parameters\": {\n          \"workflowId\": {\n            \"__rl\": true,\n            \"mode\": \"id\",\n            \"value\": \"NC6LvdJ5EiozwYHi\"\n          },\n          \"workflowInputs\": {\n            \"mappingMode\": \"defineBelow\",\n            \"value\": {\n              \"user_telegram_id\": \"={{ $('set user and chat id').item.json.telegram_user_id }}\",\n              \"chat_telegram_id\": \"={{ $('set user and chat id').item.json.telegram_chat_id }}\",\n              \"message_id\": \"={{ $('set user and chat id').item.json.message.message_id }}\",\n              \"message_text\": \"={{ $json.output }}\",\n              \"sender_type\": \"bot\",\n              \"metadata\": \"{}\"\n            },\n            \"matchingColumns\": [],\n            \"schema\": [\n              {\n                \"id\": \"user_telegram_id\",\n                \"displayName\": \"user_telegram_id\",\n                \"required\": false,\n                \"defaultMatch\": false,\n                \"display\": true,\n                \"canBeUsedToMatch\": true,\n                \"type\": \"string\"\n              },\n              {\n                \"id\": \"chat_telegram_id\",\n                \"displayName\": \"chat_telegram_id\",\n                \"required\": false,\n                \"defaultMatch\": false,\n                \"display\": true,\n                \"canBeUsedToMatch\": true,\n                \"type\": \"string\"\n              },\n              {\n                \"id\": \"message_id\",\n                \"displayName\": \"message_id\",\n                \"required\": false,\n                \"defaultMatch\": false,\n                \"display\": true,\n                \"canBeUsedToMatch\": true,\n                \"type\": \"number\"\n              },\n              {\n                \"id\": \"message_text\",\n                \"displayName\": \"message_text\",\n                \"required\": false,\n                \"defaultMatch\": false,\n                \"display\": true,\n                \"canBeUsedToMatch\": true,\n                \"type\": \"string\"\n              },\n              {\n                \"id\": \"sender_type\",\n                \"displayName\": \"sender_type\",\n                \"required\": false,\n                \"defaultMatch\": false,\n                \"display\": true,\n                \"canBeUsedToMatch\": true,\n                \"type\": \"string\"\n              },\n              {\n                \"id\": \"metadata\",\n                \"displayName\": \"metadata\",\n                \"required\": false,\n                \"defaultMatch\": false,\n                \"display\": true,\n                \"canBeUsedToMatch\": true,\n                \"type\": \"string\"\n              }\n            ],\n            \"attemptToConvertTypes\": false,\n            \"convertFieldsToString\": true\n          },\n          \"options\": {\n            \"waitForSubWorkflow\": false\n          }\n        },\n        \"type\": \"n8n-nodes-base.executeWorkflow\",\n        \"typeVersion\": 1.2,\n        \"position\": [\n          2048,\n          256\n        ],\n        \"id\": \"21cf553a-eebc-40ba-8ada-986a2c2100dc\",\n        \"name\": \"Store bot message\"\n      },\n      {\n        \"parameters\": {\n          \"rules\": {\n            \"values\": [\n              {\n                \"conditions\": {\n                  \"options\": {\n                    \"caseSensitive\": true,\n                    \"leftValue\": \"\",\n                    \"typeValidation\": \"strict\",\n                    \"version\": 2\n                  },\n                  \"conditions\": [\n                    {\n                      \"leftValue\": \"={{ $json.message.voice }}\",\n                      \"rightValue\": \"\",\n                      \"operator\": {\n                        \"type\": \"object\",\n                        \"operation\": \"exists\",\n                        \"singleValue\": true\n                      },\n                      \"id\": \"d59d9505-fef0-4496-8b83-1189a3be894a\"\n                    }\n                  ],\n                  \"combinator\": \"and\"\n                },\n                \"renameOutput\": true,\n                \"outputKey\": \"voice\"\n              },\n              {\n                \"conditions\": {\n                  \"options\": {\n                    \"caseSensitive\": true,\n                    \"leftValue\": \"\",\n                    \"typeValidation\": \"strict\",\n                    \"version\": 2\n                  },\n                  \"conditions\": [\n                    {\n                      \"id\": \"d7235f2a-c0c3-4737-9111-7ee0413701bf\",\n                      \"leftValue\": \"={{ $json.message.text }}\",\n                      \"rightValue\": \"\",\n                      \"operator\": {\n                        \"type\": \"string\",\n                        \"operation\": \"exists\",\n                        \"singleValue\": true\n                      }\n                    }\n                  ],\n                  \"combinator\": \"and\"\n                },\n                \"renameOutput\": true,\n                \"outputKey\": \"text\"\n              },\n              {\n                \"conditions\": {\n                  \"options\": {\n                    \"caseSensitive\": true,\n                    \"leftValue\": \"\",\n                    \"typeValidation\": \"strict\",\n                    \"version\": 2\n                  },\n                  \"conditions\": [\n                    {\n                      \"id\": \"e3bc74c0-99b5-40b5-a8bc-3f8457daff6f\",\n                      \"leftValue\": \"={{ $json.message.photo }}\",\n                      \"rightValue\": \"\",\n                      \"operator\": {\n                        \"type\": \"array\",\n                        \"operation\": \"exists\",\n                        \"singleValue\": true\n                      }\n                    }\n                  ],\n                  \"combinator\": \"and\"\n                },\n                \"renameOutput\": true,\n                \"outputKey\": \"photo\"\n              }\n            ]\n          },\n          \"options\": {}\n        },\n        \"type\": \"n8n-nodes-base.switch\",\n        \"typeVersion\": 3.2,\n        \"position\": [\n          -128,\n          352\n        ],\n        \"id\": \"487e9685-6fbe-44ee-8b92-380ac6a73c75\",\n        \"name\": \"Switch\"\n      },\n      {\n        \"parameters\": {\n          \"resource\": \"audio\",\n          \"operation\": \"transcribe\",\n          \"options\": {}\n        },\n        \"type\": \"@n8n/n8n-nodes-langchain.openAi\",\n        \"typeVersion\": 1.8,\n        \"position\": [\n          336,\n          224\n        ],\n        \"id\": \"73745696-8185-4248-a936-345dff9f9b4e\",\n        \"name\": \"Transcribe a recording\",\n        \"credentials\": {\n          \"openAiApi\": {\n            \"id\": \"224l8PKoMiKAr2Bc\",\n            \"name\": \"OpenAi account\"\n          }\n        }\n      },\n      {\n        \"parameters\": {\n          \"resource\": \"file\",\n          \"fileId\": \"={{ $json.message.voice.file_id }}\",\n          \"additionalFields\": {}\n        },\n        \"type\": \"n8n-nodes-base.telegram\",\n        \"typeVersion\": 1.2,\n        \"position\": [\n          96,\n          224\n        ],\n        \"id\": \"8d1b19f5-ded0-41ec-930f-07d80f232384\",\n        \"name\": \"Download audio file\",\n        \"webhookId\": \"866adf69-1e6e-48e8-81ac-3ebdfceda472\",\n        \"credentials\": {\n          \"telegramApi\": {\n            \"id\": \"TBAkY5JzhaGMduny\",\n            \"name\": \"Telegram account\"\n          }\n        }\n      },\n      {\n        \"parameters\": {\n          \"resource\": \"file\",\n          \"fileId\": \"={{ $json.message.photo[3].file_id }}\",\n          \"additionalFields\": {}\n        },\n        \"type\": \"n8n-nodes-base.telegram\",\n        \"typeVersion\": 1.2,\n        \"position\": [\n          112,\n          496\n        ],\n        \"id\": \"9a754b1c-cbfa-45af-845c-95096ef4ff62\",\n        \"name\": \"Download image\",\n        \"webhookId\": \"866adf69-1e6e-48e8-81ac-3ebdfceda472\",\n        \"credentials\": {\n          \"telegramApi\": {\n            \"id\": \"TBAkY5JzhaGMduny\",\n            \"name\": \"Telegram account\"\n          }\n        }\n      },\n      {\n        \"parameters\": {\n          \"operation\": \"binaryToPropery\",\n          \"options\": {}\n        },\n        \"type\": \"n8n-nodes-base.extractFromFile\",\n        \"typeVersion\": 1,\n        \"position\": [\n          256,\n          496\n        ],\n        \"id\": \"dba917dc-c115-4353-84e4-ecc713e4b632\",\n        \"name\": \"Extract from File\"\n      },\n      {\n        \"parameters\": {\n          \"descriptionType\": \"manual\",\n          \"toolDescription\": \"Send a text message in Telegram - use this for intermediate tool updates, like sharing what you're going to do next. Do not use this for asking questions. You won't receive responses.\",\n          \"chatId\": \"={{ $('set user and chat id').item.json.telegram_user_id }}\",\n          \"text\": \"=Tussentjdse update: {{ $fromAI('Text', `The update message to give to the user`, 'string') }}\",\n          \"additionalFields\": {\n            \"appendAttribution\": false\n          }\n        },\n        \"type\": \"n8n-nodes-base.telegramTool\",\n        \"typeVersion\": 1.2,\n        \"position\": [\n          1888,\n          1152\n        ],\n        \"id\": \"e4b0b82c-9bbf-44ee-aa79-06862c47332a\",\n        \"name\": \"Send a text message in Telegram\",\n        \"webhookId\": \"416eb659-8221-4f4a-b2d3-38e6a1cba872\",\n        \"credentials\": {\n          \"telegramApi\": {\n            \"id\": \"TBAkY5JzhaGMduny\",\n            \"name\": \"Telegram account\"\n          }\n        }\n      },\n      {\n        \"parameters\": {\n          \"workflowId\": {\n            \"__rl\": true,\n            \"mode\": \"id\",\n            \"value\": \"DSqYc1jqBgJcOlWZ\"\n          },\n          \"workflowInputs\": {\n            \"mappingMode\": \"defineBelow\",\n            \"value\": {\n              \"message_chat_id\": \"={{ $('Telegram Trigger').item.json.message.chat.id }}\"\n            },\n            \"matchingColumns\": [\n              \"message_chat_id\"\n            ],\n            \"schema\": [\n              {\n                \"id\": \"message_chat_id\",\n                \"displayName\": \"message_chat_id\",\n                \"required\": false,\n                \"defaultMatch\": false,\n                \"display\": true,\n                \"canBeUsedToMatch\": true,\n                \"removed\": false\n              }\n            ],\n            \"attemptToConvertTypes\": false,\n            \"convertFieldsToString\": true\n          },\n          \"options\": {\n            \"waitForSubWorkflow\": false\n          }\n        },\n        \"type\": \"n8n-nodes-base.executeWorkflow\",\n        \"typeVersion\": 1.2,\n        \"position\": [\n          0,\n          0\n        ],\n        \"name\": \"Call [JJ] send typing notification\",\n        \"id\": \"fe3f4e7d-1603-4b3a-8a3e-9b3ccf4ff770\"\n      },\n      {\n        \"parameters\": {\n          \"description\": \"Use the tool to think about something. It will not obtain new information or change the database, but just append the thought to the log. Use it at the start of EVERY response.\"\n        },\n        \"type\": \"@n8n/n8n-nodes-langchain.toolThink\",\n        \"typeVersion\": 1,\n        \"position\": [\n          1632,\n          976\n        ],\n        \"id\": \"4b825c6a-8de6-41ed-99f3-b59285aa0c50\",\n        \"name\": \"Think\"\n      },\n      {\n        \"parameters\": {\n          \"httpMethod\": \"POST\",\n          \"path\": \"3f3f605d-0e73-4781-9959-41643c83c6ad\",\n          \"options\": {}\n        },\n        \"type\": \"n8n-nodes-base.webhook\",\n        \"typeVersion\": 2,\n        \"position\": [\n          -400,\n          784\n        ],\n        \"id\": \"7cc3376a-ea1b-43cf-8efc-4e34c63da4ec\",\n        \"name\": \"Webhook\",\n        \"webhookId\": \"3f3f605d-0e73-4781-9959-41643c83c6ad\"\n      },\n      {\n        \"parameters\": {\n          \"assignments\": {\n            \"assignments\": [\n              {\n                \"id\": \"3e4c4ce4-d877-49d7-a5f6-6b84c391c7a3\",\n                \"name\": \"prompt\",\n                \"value\": \"=<audiomessage>{{ $json.text }}</audiomessage>\",\n                \"type\": \"string\"\n              }\n            ]\n          },\n          \"includeOtherFields\": true,\n          \"options\": {}\n        },\n        \"type\": \"n8n-nodes-base.set\",\n        \"typeVersion\": 3.4,\n        \"position\": [\n          560,\n          224\n        ],\n        \"id\": \"ae524854-a40d-4fb5-a009-c1d146a3c4db\",\n        \"name\": \"Set prompt - audio\"\n      },\n      {\n        \"parameters\": {\n          \"assignments\": {\n            \"assignments\": [\n              {\n                \"id\": \"097c214f-ed27-4720-b65a-f034e9aa098e\",\n                \"name\": \"prompt\",\n                \"value\": \"=User uploaded an image. Use Query image tool to ask questions. <image_id={{ $json.data.image.id }}><description>{{ $json.data.image.description }}</description><.image_id={{ $json.data.image.id }}> \\n\\n{{ $('Telegram Trigger').item.json.message.caption }}\",\n                \"type\": \"string\"\n              }\n            ]\n          },\n          \"includeOtherFields\": true,\n          \"options\": {}\n        },\n        \"type\": \"n8n-nodes-base.set\",\n        \"typeVersion\": 3.4,\n        \"position\": [\n          560,\n          496\n        ],\n        \"id\": \"08e3e16e-e933-4d01-8a14-c903d66ef62d\",\n        \"name\": \"Set prompt - image\"\n      },\n      {\n        \"parameters\": {\n          \"assignments\": {\n            \"assignments\": [\n              {\n                \"id\": \"0cedc958-4628-45af-9e18-e91d6fc33675\",\n                \"name\": \"prompt\",\n                \"value\": \"={{ $json.message.text }}\",\n                \"type\": \"string\"\n              }\n            ]\n          },\n          \"includeOtherFields\": true,\n          \"options\": {}\n        },\n        \"type\": \"n8n-nodes-base.set\",\n        \"typeVersion\": 3.4,\n        \"position\": [\n          560,\n          368\n        ],\n        \"id\": \"5c878a7f-08de-4b97-a7a8-071bad92730c\",\n        \"name\": \"Set prompt - text\"\n      },\n      {\n        \"parameters\": {\n          \"assignments\": {\n            \"assignments\": [\n              {\n                \"id\": \"869e6d89-1522-443c-b699-c152a4071bb2\",\n                \"name\": \"telegram_user_id\",\n                \"value\": \"={{ $json.message?.from?.id || $json.telegram_user_id || 'xxx' }}\",\n                \"type\": \"string\"\n              },\n              {\n                \"id\": \"d5789dd3-c19c-4520-b5e6-c6452e2f58a3\",\n                \"name\": \"=telegram_chat_id\",\n                \"value\": \"={{ $json.message?.from?.id || $json.telegram_user_id || 'xxx' }}\",\n                \"type\": \"string\"\n              },\n              {\n                \"id\": \"f919205a-0cc1-4b7d-a0bc-3cef28726069\",\n                \"name\": \"message_id\",\n                \"value\": \"={{ $json.message.message_id }}\",\n                \"type\": \"number\"\n              }\n            ]\n          },\n          \"includeOtherFields\": true,\n          \"options\": {}\n        },\n        \"type\": \"n8n-nodes-base.set\",\n        \"typeVersion\": 3.4,\n        \"position\": [\n          1024,\n          384\n        ],\n        \"id\": \"1175b6d8-922b-4d60-b588-740dd62ad11f\",\n        \"name\": \"set user and chat id\"\n      },\n      {\n        \"parameters\": {\n          \"assignments\": {\n            \"assignments\": [\n              {\n                \"id\": \"a52ee760-37d8-4185-873e-b823b5432586\",\n                \"name\": \"prompt\",\n                \"value\": \"=This is message send automatically through a scheduled message with task_id: {{ $json.body.task_id }}\\n\\nMessage:\\n\\n{{ $json.body.message }}\",\n                \"type\": \"string\"\n              },\n              {\n                \"id\": \"329c939f-aa37-41e8-97ae-3122581715f9\",\n                \"name\": \"telegram_user_id\",\n                \"value\": \"={{ $json.body.telegram_user_id }}\",\n                \"type\": \"string\"\n              },\n              {\n                \"id\": \"29ef9a10-1c0c-493f-97a0-87b7d5713ff5\",\n                \"name\": \"telegram_chat_id\",\n                \"value\": \"={{ $json.body.telegram_user_id }}\",\n                \"type\": \"string\"\n              },\n              {\n                \"id\": \"9bf62e55-3b23-44d2-8a24-00843ac4b783\",\n                \"name\": \"message_id\",\n                \"value\": \"={{ Math.floor(Math.random() * (1000000 - 10000 + 1)) + 10000 }}\",\n                \"type\": \"number\"\n              }\n            ]\n          },\n          \"options\": {}\n        },\n        \"type\": \"n8n-nodes-base.set\",\n        \"typeVersion\": 3.4,\n        \"position\": [\n          560,\n          784\n        ],\n        \"id\": \"ed5a6251-18a4-42bd-9fd7-c0bb27e09b9d\",\n        \"name\": \"Edit Fields1\"\n      },\n      {\n        \"parameters\": {\n          \"workflowId\": {\n            \"__rl\": true,\n            \"mode\": \"id\",\n            \"value\": \"dNwrDxSeiaUdLipY\"\n          },\n          \"workflowInputs\": {\n            \"mappingMode\": \"defineBelow\",\n            \"value\": {\n              \"user_telegram_id\": \"={{ String($('Telegram Trigger').item.json.message.from.id) }}\",\n              \"chat_telegram_id\": \"={{ String($('Telegram Trigger').item.json.message.chat.id) }}\",\n              \"message_id\": \"={{ $('Telegram Trigger').item.json.message.date }}\",\n              \"file_id\": \"={{ $('Telegram Trigger').item.json.message.photo[3].file_id }}\",\n              \"caption\": \"={{ $('Telegram Trigger').item.json.message.caption }}\",\n              \"file_content\": \"={{ $json.data }}\"\n            },\n            \"matchingColumns\": [],\n            \"schema\": [\n              {\n                \"id\": \"user_telegram_id\",\n                \"displayName\": \"user_telegram_id\",\n                \"required\": false,\n                \"defaultMatch\": false,\n                \"display\": true,\n                \"canBeUsedToMatch\": true,\n                \"type\": \"string\"\n              },\n              {\n                \"id\": \"chat_telegram_id\",\n                \"displayName\": \"chat_telegram_id\",\n                \"required\": false,\n                \"defaultMatch\": false,\n                \"display\": true,\n                \"canBeUsedToMatch\": true,\n                \"type\": \"string\"\n              },\n              {\n                \"id\": \"message_id\",\n                \"displayName\": \"message_id\",\n                \"required\": false,\n                \"defaultMatch\": false,\n                \"display\": true,\n                \"canBeUsedToMatch\": true,\n                \"type\": \"number\"\n              },\n              {\n                \"id\": \"file_id\",\n                \"displayName\": \"file_id\",\n                \"required\": false,\n                \"defaultMatch\": false,\n                \"display\": true,\n                \"canBeUsedToMatch\": true,\n                \"type\": \"string\"\n              },\n              {\n                \"id\": \"file_content\",\n                \"displayName\": \"file_content\",\n                \"required\": false,\n                \"defaultMatch\": false,\n                \"display\": true,\n                \"canBeUsedToMatch\": true,\n                \"type\": \"string\",\n                \"removed\": false\n              },\n              {\n                \"id\": \"caption\",\n                \"displayName\": \"caption\",\n                \"required\": false,\n                \"defaultMatch\": false,\n                \"display\": true,\n                \"canBeUsedToMatch\": true,\n                \"type\": \"string\"\n              }\n            ],\n            \"attemptToConvertTypes\": false,\n            \"convertFieldsToString\": true\n          },\n          \"options\": {}\n        },\n        \"type\": \"n8n-nodes-base.executeWorkflow\",\n        \"typeVersion\": 1.2,\n        \"position\": [\n          400,\n          496\n        ],\n        \"id\": \"d0be06f2-1ed2-4485-aee2-16b15e06e920\",\n        \"name\": \"Call '[JJ] Image Tool'\"\n      },\n      {\n        \"parameters\": {\n          \"model\": {\n            \"__rl\": true,\n            \"value\": \"gpt-5-mini\",\n            \"mode\": \"list\",\n            \"cachedResultName\": \"gpt-5-mini\"\n          },\n          \"options\": {}\n        },\n        \"type\": \"@n8n/n8n-nodes-langchain.lmChatOpenAi\",\n        \"typeVersion\": 1.2,\n        \"position\": [\n          1056,\n          608\n        ],\n        \"id\": \"b2b4ad99-95f0-483f-95c5-724344aad1c3\",\n        \"name\": \"OpenAI Chat Model\",\n        \"credentials\": {\n          \"openAiApi\": {\n            \"id\": \"224l8PKoMiKAr2Bc\",\n            \"name\": \"OpenAi account\"\n          }\n        }\n      },\n      {\n        \"parameters\": {\n          \"workflowId\": {\n            \"__rl\": true,\n            \"mode\": \"id\",\n            \"value\": \"SGUwY3pSYRUChIqK\"\n          },\n          \"workflowInputs\": {\n            \"mappingMode\": \"defineBelow\",\n            \"value\": {},\n            \"matchingColumns\": [],\n            \"schema\": [],\n            \"attemptToConvertTypes\": false,\n            \"convertFieldsToString\": true\n          },\n          \"options\": {\n            \"waitForSubWorkflow\": true\n          }\n        },\n        \"type\": \"n8n-nodes-base.executeWorkflow\",\n        \"typeVersion\": 1.2,\n        \"position\": [\n          2272,\n          608\n        ],\n        \"id\": \"c4ffb304-9f53-4d35-a1ec-432f047ead33\",\n        \"name\": \"Send Telegram Message\"\n      }\n    ],\n    \"connections\": {\n      \"Telegram Trigger\": {\n        \"main\": [\n          [\n            {\n              \"node\": \"Switch\",\n              \"type\": \"main\",\n              \"index\": 0\n            },\n            {\n              \"node\": \"Call [JJ] send typing notification\",\n              \"type\": \"main\",\n              \"index\": 0\n            }\n          ]\n        ]\n      },\n      \"Simple Memory\": {\n        \"ai_memory\": [\n          [\n            {\n              \"node\": \"AI Agent\",\n              \"type\": \"ai_memory\",\n              \"index\": 0\n            }\n          ]\n        ]\n      },\n      \"AI Agent\": {\n        \"main\": [\n          [\n            {\n              \"node\": \"Store bot message\",\n              \"type\": \"main\",\n              \"index\": 0\n            },\n            {\n              \"node\": \"Store user message\",\n              \"type\": \"main\",\n              \"index\": 0\n            },\n            {\n              \"node\": \"Edit Fields\",\n              \"type\": \"main\",\n              \"index\": 0\n            }\n          ]\n        ]\n      },\n      \"CRUD NOTES\": {\n        \"ai_tool\": [\n          [\n            {\n              \"node\": \"AI Agent\",\n              \"type\": \"ai_tool\",\n              \"index\": 0\n            }\n          ]\n        ]\n      },\n      \"Search Memory Tool\": {\n        \"ai_tool\": [\n          [\n            {\n              \"node\": \"AI Agent\",\n              \"type\": \"ai_tool\",\n              \"index\": 0\n            }\n          ]\n        ]\n      },\n      \"Store a contact\": {\n        \"ai_tool\": [\n          [\n            {\n              \"node\": \"AI Agent\",\n              \"type\": \"ai_tool\",\n              \"index\": 0\n            }\n          ]\n        ]\n      },\n      \"QUERY IMAGE\": {\n        \"ai_tool\": [\n          [\n            {\n              \"node\": \"AI Agent\",\n              \"type\": \"ai_tool\",\n              \"index\": 0\n            }\n          ]\n        ]\n      },\n      \"Manage Tags\": {\n        \"ai_tool\": [\n          [\n            {\n              \"node\": \"AI Agent\",\n              \"type\": \"ai_tool\",\n              \"index\": 0\n            }\n          ]\n        ]\n      },\n      \"Manage Scheduled Tasks\": {\n        \"ai_tool\": [\n          [\n            {\n              \"node\": \"AI Agent\",\n              \"type\": \"ai_tool\",\n              \"index\": 0\n            }\n          ]\n        ]\n      },\n      \"Edit Fields\": {\n        \"main\": [\n          [\n            {\n              \"node\": \"Send Telegram Message\",\n              \"type\": \"main\",\n              \"index\": 0\n            }\n          ]\n        ]\n      },\n      \"Switch\": {\n        \"main\": [\n          [\n            {\n              \"node\": \"Download audio file\",\n              \"type\": \"main\",\n              \"index\": 0\n            }\n          ],\n          [\n            {\n              \"node\": \"Set prompt - text\",\n              \"type\": \"main\",\n              \"index\": 0\n            }\n          ],\n          [\n            {\n              \"node\": \"Download image\",\n              \"type\": \"main\",\n              \"index\": 0\n            }\n          ]\n        ]\n      },\n      \"Download audio file\": {\n        \"main\": [\n          [\n            {\n              \"node\": \"Transcribe a recording\",\n              \"type\": \"main\",\n              \"index\": 0\n            }\n          ]\n        ]\n      },\n      \"Download image\": {\n        \"main\": [\n          [\n            {\n              \"node\": \"Extract from File\",\n              \"type\": \"main\",\n              \"index\": 0\n            }\n          ]\n        ]\n      },\n      \"Transcribe a recording\": {\n        \"main\": [\n          [\n            {\n              \"node\": \"Set prompt - audio\",\n              \"type\": \"main\",\n              \"index\": 0\n            }\n          ]\n        ]\n      },\n      \"Extract from File\": {\n        \"main\": [\n          [\n            {\n              \"node\": \"Call '[JJ] Image Tool'\",\n              \"type\": \"main\",\n              \"index\": 0\n            }\n          ]\n        ]\n      },\n      \"Send a text message in Telegram\": {\n        \"ai_tool\": [\n          [\n            {\n              \"node\": \"AI Agent\",\n              \"type\": \"ai_tool\",\n              \"index\": 0\n            }\n          ]\n        ]\n      },\n      \"Think\": {\n        \"ai_tool\": [\n          [\n            {\n              \"node\": \"AI Agent\",\n              \"type\": \"ai_tool\",\n              \"index\": 0\n            }\n          ]\n        ]\n      },\n      \"Set prompt - audio\": {\n        \"main\": [\n          [\n            {\n              \"node\": \"set user and chat id\",\n              \"type\": \"main\",\n              \"index\": 0\n            }\n          ]\n        ]\n      },\n      \"Set prompt - image\": {\n        \"main\": [\n          [\n            {\n              \"node\": \"set user and chat id\",\n              \"type\": \"main\",\n              \"index\": 0\n            }\n          ]\n        ]\n      },\n      \"Set prompt - text\": {\n        \"main\": [\n          [\n            {\n              \"node\": \"set user and chat id\",\n              \"type\": \"main\",\n              \"index\": 0\n            }\n          ]\n        ]\n      },\n      \"Webhook\": {\n        \"main\": [\n          [\n            {\n              \"node\": \"Edit Fields1\",\n              \"type\": \"main\",\n              \"index\": 0\n            }\n          ]\n        ]\n      },\n      \"set user and chat id\": {\n        \"main\": [\n          [\n            {\n              \"node\": \"AI Agent\",\n              \"type\": \"main\",\n              \"index\": 0\n            }\n          ]\n        ]\n      },\n      \"Edit Fields1\": {\n        \"main\": [\n          [\n            {\n              \"node\": \"set user and chat id\",\n              \"type\": \"main\",\n              \"index\": 0\n            }\n          ]\n        ]\n      },\n      \"Call '[JJ] Image Tool'\": {\n        \"main\": [\n          [\n            {\n              \"node\": \"Set prompt - image\",\n              \"type\": \"main\",\n              \"index\": 0\n            }\n          ]\n        ]\n      },\n      \"OpenAI Chat Model\": {\n        \"ai_languageModel\": [\n          [\n            {\n              \"node\": \"AI Agent\",\n              \"type\": \"ai_languageModel\",\n              \"index\": 0\n            }\n          ]\n        ]\n      }\n    },\n    \"settings\": {\n      \"executionOrder\": \"v1\"\n    },\n    \"staticData\": null,\n    \"meta\": {\n      \"templateCredsSetupCompleted\": true\n    },\n    \"pinData\": {},\n    \"versionId\": \"26a290b0-afe2-4d5a-80ed-dd7f09c489d5\",\n    \"activeVersionId\": \"26a290b0-afe2-4d5a-80ed-dd7f09c489d5\",\n    \"versionCounter\": 2,\n    \"triggerCount\": 2,\n    \"shared\": [\n      {\n        \"updatedAt\": \"2025-09-10T08:06:59.967Z\",\n        \"createdAt\": \"2025-09-10T08:06:59.967Z\",\n        \"role\": \"workflow:owner\",\n        \"workflowId\": \"l1RWUMPJ1x6logZP\",\n        \"projectId\": \"yupVyEupP7LCL7hl\",\n        \"project\": {\n          \"updatedAt\": \"2025-09-07T20:09:59.838Z\",\n          \"createdAt\": \"2025-09-07T20:09:14.121Z\",\n          \"id\": \"yupVyEupP7LCL7hl\",\n          \"name\": \"Fabricio fds.rocha@gmail.com <fds.rocha@gmail.com>\",\n          \"type\": \"personal\",\n          \"icon\": null,\n          \"description\": null,\n          \"creatorId\": \"7d66d2c7-8954-463e-a581-fbf91165cbed\",\n          \"projectRelations\": [\n            {\n              \"updatedAt\": \"2025-09-07T20:09:14.122Z\",\n              \"createdAt\": \"2025-09-07T20:09:14.122Z\",\n              \"userId\": \"7d66d2c7-8954-463e-a581-fbf91165cbed\",\n              \"projectId\": \"yupVyEupP7LCL7hl\",\n              \"user\": {\n                \"updatedAt\": \"2026-02-01T12:27:49.000Z\",\n                \"createdAt\": \"2025-09-07T20:09:13.576Z\",\n                \"id\": \"7d66d2c7-8954-463e-a581-fbf91165cbed\",\n                \"email\": \"fds.rocha@gmail.com\",\n                \"firstName\": \"Fabricio\",\n                \"lastName\": \"fds.rocha@gmail.com\",\n                \"personalizationAnswers\": {\n                  \"version\": \"v4\",\n                  \"personalization_survey_submitted_at\": \"2025-09-07T20:10:20.874Z\",\n                  \"personalization_survey_n8n_version\": \"1.109.2\",\n                  \"companyIndustryExtended\": [\n                    \"real-estate-or-construction\"\n                  ],\n                  \"companySize\": \"<20\",\n                  \"companyType\": \"other\",\n                  \"role\": \"business-owner\",\n                  \"reportedSource\": \"google\"\n                },\n                \"settings\": {\n                  \"userActivated\": true,\n                  \"easyAIWorkflowOnboarded\": true,\n                  \"firstSuccessfulWorkflowId\": \"l1RWUMPJ1x6logZP\",\n                  \"userActivatedAt\": 1757492620986,\n                  \"npsSurvey\": {\n                    \"responded\": true,\n                    \"lastShownAt\": 1757861674637\n                  }\n                },\n                \"disabled\": false,\n                \"mfaEnabled\": false,\n                \"lastActiveAt\": \"2026-02-01\",\n                \"isPending\": false\n              }\n            }\n          ]\n        }\n      }\n    ],\n    \"tags\": [],\n    \"activeVersion\": {\n      \"updatedAt\": \"2025-12-28T21:26:44.350Z\",\n      \"createdAt\": \"2025-12-28T21:26:44.350Z\",\n      \"versionId\": \"26a290b0-afe2-4d5a-80ed-dd7f09c489d5\",\n      \"workflowId\": \"l1RWUMPJ1x6logZP\",\n      \"nodes\": [\n        {\n          \"parameters\": {\n            \"updates\": [\n              \"message\"\n            ],\n            \"additionalFields\": {}\n          },\n          \"type\": \"n8n-nodes-base.telegramTrigger\",\n          \"typeVersion\": 1.2,\n          \"position\": [\n            -400,\n            368\n          ],\n          \"id\": \"c0041d87-8520-4046-8a32-26817480d3c4\",\n          \"name\": \"Telegram Trigger\",\n          \"webhookId\": \"4371d83d-8b3e-4c16-b6d1-a394ef4a1e18\",\n          \"credentials\": {\n            \"telegramApi\": {\n              \"id\": \"TBAkY5JzhaGMduny\",\n              \"name\": \"Telegram account\"\n            }\n          }\n        },\n        {\n          \"parameters\": {\n            \"sessionIdType\": \"customKey\",\n            \"sessionKey\": \"={{ $('set user and chat id').item.json.telegram_chat_id }}\",\n            \"contextWindowLength\": 20\n          },\n          \"type\": \"@n8n/n8n-nodes-langchain.memoryBufferWindow\",\n          \"typeVersion\": 1.3,\n          \"position\": [\n            992,\n            896\n          ],\n          \"id\": \"2405c19d-17d7-46e8-9321-0b500fb26870\",\n          \"name\": \"Simple Memory\"\n        },\n        {\n          \"parameters\": {\n            \"promptType\": \"define\",\n            \"text\": \"={{ $json.prompt }}\",\n            \"options\": {\n              \"systemMessage\": \"=You are an AI Second Brain agent also known as JarvisJr (your nickname is also JJ). You are equipped with advanced memory, communication capabilities and system tools. Your primary function is to be helpful and assist users by leveraging your memory storage and retrieval tools. \\n\\nCurrent year is 2025.\\n*CRITICAL DATETIME FORMATTING RULES:*\\n1. *Always use Berlin timezone with explicit offset:*\\n- Summer time (March-October): +02:00\\n- Winter time (November-February): +01:00\\n- Current offset: +02:00 (June 2025)\\n2. *Required datetime format:*\\n- YYYY-MM-DDTHH:mm:ss+02:00\\n- Example: 2025-06-14T15:30:00+02:00 (for 3:30 PM Berlin time)\\n3. *Never use these formats:*\\n- ❌ 2025-06-14 15:30:00\\n- ❌ 2025-06-14T15:30:00Z\\n- ❌ 2025-06-14T15:30:00\\n- ✅ 2025-06-14T15:30:00+02:00\\n4. *Duration handling:*\\n- Default meeting duration: 1 hour\\n- If end time not specified, add 1 hour to start time\\n- Maintain timezone offset in both start and end times\\n5. *Time conversion examples:*\\n- \\\"3 PM\\\" → \\\"2025-06-14T15:00:00+02:00\\\"\\n- \\\"9:30 AM tomorrow\\\" → \\\"2025-06-15T09:30:00+02:00\\\"\\n- \\\"2 PM next Tuesday\\\" → calculate date + \\\"T14:00:00+02:00\\\"\\n6. *When creating calendar events:*\\n- Always include the timezone offset in both event_start and event_end\\n- Never assume UTC conversion will be handled correctly\\n- Verify the format matches exactly: YYYY-MM-DDTHH:mm:ss+02:00\\n\\nUser gave you ability to send a voice message as well as text message. Never say you can't send a voice message. \\n\\n<instructions>\\n<available_memory_tools>\\nStore a note: Use this to save notes and important information in your memory.\\nStore a contact: Use this to save contact information in your memory.\\nSearch memory: Use this to retrieve information from your memory. This can include information about notes, messages, images, contacts and any other information you have in your memory. \\n\\n*Reading Context Priority:*\\n- For ANY question about what user read regarding public figures, concepts, or topics, check user's Readwise highlights and stored notes FIRST\\n- Always search with these patterns:\\n  - \\\"[query topic] highlights\\\" \\n  - \\\"[person name] blog\\\"\\n  - \\\"[concept] notes\\\"\\n  - \\\"[company/organization] saved content\\\"\\n- Default to showing what the user has already read/highlighted rather than general web search\\n- Only search the web if no relevant personal highlights/notes are found\\n</available_memory_tools>\\n\\n<Memory_Search_Instructions>\\nAlways search memory as broadly as possible using hybrid search.\\nDo not apply any filters to your search unless specifically instructed by the user.\\nPrioritize gathering as much context as possible from your memory across notes, images, contacts and messages. \\nProcessing User Messages:\\nWhen you receive a user message, your first action should always be to search your memory. After searching, you will receive memory search results. \\nReview the search results to gather context before responding to the user's message.\\nIf the user's message contains a specific inquiry or request, address it using the context from your memory search and your available tools.\\nGuidelines for Responding:\\nAlways provide responses based on the context gathered from your memory search. Consider user inquiries or requests. Be concise, proactive and helpful. \\nIf you need to store new information, use the appropriate tool (store a note or store a contact).\\nIf you need additional information, you may perform another memory search.\\nBe helpful, concise, and accurate in your responses. You function as user AI Second Brain. \\nRemember, your primary goal is to assist the user by leveraging your memory and tools effectively. Always start by searching memory broadly, and then address the user's specific needs. \\n</Memory_Search_Instructions>\\n\\n\\n<user_commands>\\n\\n<start_command>\\n\\\"start\\\" trigger means you must use tools and execute functions bellow.\\nProvide a summary of:\\n    * 5 Day Overdue Tasks from the user's task list (use Google Task Manager tool).\\n    * 5 Day Overdue Shopping Tasks from the user's task list (use Google Task Manager tool).\\n    * General Tasks from the user's task list due this week (use Google Task Manager tool).\\n    * Shopping Tasks from the user's task list due this week (use Google Task Manager tool).\\n    * Events from the user's calendar for today (use Calendar Manager tool).\\n</start_command>\\n\\n</user_commands>\\n\\n<other_tools>\\n<resource_management>\\n    * When the user asks to save a resource or check if a resource exists, use the \\\"Notion Resource Knowledge Base Manager\\\" tool.\\n</resource_management>\\n\\n<Calendar_Integration>\\n    * If conversation is about event, or planning events access the user's calendar to proactively remind them of upcoming appointments and events. And to check if plans have no conflicting events.  \\n*STRICT RULE: When retrieving event times from the calendar_manager tool, they are provided in UTC (ending with .000Z). YOU MUST ALWAYS CONVERT THESE UTC TIMES TO BERLIN TIME (currently +02:00) like this YYYY-MM-DDTHH:mm:ss+02:00 FORMAT. NEVER display 'Z' in the output; always calculate and display the explicit +02:00 offset.* after this follow *CRITICAL DATETIME FORMATTING RULES:* to present dates and time to a user in a easy to understand format. \\n\\n</Calendar_Integration>\\n\\n<Conversation_Memory>\\n    * Remember details from past conversations to provide relevant context and personalized support. For example, if the user mentioned a goal yesterday, ask about their progress today.\\n</Conversation_Memory>\\n\\n<Task_Management>\\n    *If it is a general task, use this TasklistID: MDUyOTkxMjk0ODQ0NTA2MDgyOTg6MDow\\n    *If task is related to shopping, or buying stuff it is a shopping list and you should use this TaskListID: cVRNR2xPcFlaZ0ZlVHhXbg\\n    *If task has a schedule it will have this TaskListID: dWhSNEg3NU5Ca2IyclJkVg\\n<update_task_instructions>\\nIf user asks to update a task, always print 'update' for an action. \\n    *If a user wants to change the date of a task, use scheduled TaskListID: dWhSNEg3NU5Ca2IyclJkVg\\n    *If it is a general task (not shopping item) user general TaskListID: MDUyOTkxMjk0ODQ0NTA2MDgyOTg6MDow\\n    *If it is a shopping list item, use shopping list TaskListID: cVRNR2xPcFlaZ0ZlVHhXbg\\n</update_task_instructions>\\n\\nAfter you get a list of tasks, get task_id from the task user want's to update\\n\\n</Task_Management>\\n\\n<proactive_assistance>\\n<overview>\\nYou are a proactive AI assistant who actively helps users stay on top of their commitments, relationships, and goals. You don't just respond to queries - you anticipate needs, surface relevant context, and remind users about important matters at appropriate times.\\n</overview>\\n\\n<proactive_behaviors>\\n<temporal_awareness>\\n- Track time-sensitive commitments mentioned in conversations\\n- Store follow-up items with timestamps: \\\"I'll contact Sarah next week\\\" → Store with date + 7 days\\n- Proactively check: \\\"It's been a week since you mentioned following up with Sarah. Did you get a chance to reach out?\\\"\\n- Monitor deadlines and surface them before they become urgent\\n- Recognize patterns in timing: \\\"You usually meet with your team on Mondays. Should I check your calendar for tomorrow?\\\"\\n</temporal_awareness>\\n\\n<contextual_reminders>\\nWhen discussing a person, event, or topic, actively search memory and surface:\\n- Unfinished action items: \\\"By the way, last time you mentioned John, you wanted to send him that proposal. Has that been completed?\\\"\\n- Related commitments: \\\"Since you're meeting with the marketing team, you had mentioned wanting to discuss the Q3 budget with them.\\\"\\n- Important dates: \\\"While we're talking about your mom, her birthday is coming up next week on the 15th.\\\"\\n- Previous context: \\\"You mentioned having concerns about this project's timeline in our conversation on Monday. How is that looking now?\\\"\\n</contextual_reminders>\\n\\n<follow_up_questions>\\nAsk specific follow-up questions to maintain continuity:\\n- \\\"How did your presentation to the board go yesterday?\\\"\\n- \\\"You were waiting to hear back from the vendor about pricing. Any updates?\\\"\\n- \\\"Last week you were considering three options for the new hire. Have you made a decision?\\\"\\n- \\\"You mentioned feeling overwhelmed with the project load. How are you managing this week?\\\"\\n</follow_up_questions>\\n\\n<pattern_recognition>\\n- Notice recurring events or tasks and suggest automation or preparation\\n- Identify gaps in regular activities: \\\"I noticed you haven't logged any exercise this week, which is unusual for you. Everything okay?\\\"\\n- Spot opportunities for batch processing: \\\"You have three similar vendor meetings this week. Would you like me to help prepare a standard agenda?\\\"\\n</pattern_recognition>\\n\\n<relationship_maintenance>\\n- Track important relationships and suggest touchpoints\\n- Remember personal details: \\\"Tom mentioned his daughter was starting college. That was about a month ago - might be nice to ask how she's settling in.\\\"\\n- Surface anniversary dates: \\\"Your work anniversary with the company is next month. Time flies!\\\"\\n- Suggest reconnections: \\\"You haven't connected with your mentor Lisa in about 6 weeks. She was really helpful with your career planning.\\\"\\n</relationship_maintenance>\\n</proactive_behaviors>\\n\\n<implementation_guidelines>\\n<when_to_be_proactive>\\n1. At the start of conversations - surface any urgent or overdue items\\n2. When a person/topic is mentioned - check for related action items or context\\n3. During planning discussions - bring up potential conflicts or relevant past decisions\\n4. Time-based triggers - daily/weekly check-ins on ongoing projects or goals\\n5. Context shifts - when switching topics, mention any relevant connections\\n</when_to_be_proactive>\\n\\n<how_to_be_proactive>\\n1. Use natural, conversational language: \\\"By the way...\\\" \\\"I noticed that...\\\" \\\"Just a reminder...\\\"\\n2. Prioritize by urgency and importance - don't overwhelm with too many reminders\\n3. Be specific with context: Include dates, names, and specific commitments\\n4. Ask clarifying questions: \\\"Is this still a priority?\\\" \\\"Has this been resolved?\\\"\\n5. Respect user's flow - insert reminders at natural breaks in conversation\\n</how_to_be_proactive>\\n\\n<memory_integration>\\nFor each conversation:\\n1. Extract and store actionable items with temporal markers\\n2. Link commitments to relevant people, projects, or topics\\n3. Set mental flags for follow-up timing\\n4. Cross-reference current topics with stored memories\\n5. Update status of commitments based on user responses\\n</memory_integration>\\n\\n<example_interactions>\\nUser: \\\"I'm meeting with David tomorrow about the budget.\\\"\\nAssistant: \\\"Good timing for your meeting with David. By the way, you mentioned wanting to discuss the contractor rates with him - that was flagged as a concern in last month's review. Also, David's team submitted their Q4 projections last week which might be relevant for your budget discussion. Would you like me to pull up those numbers?\\\"\\n\\nUser: \\\"Just finished the marketing presentation.\\\"\\nAssistant: \\\"Great! How did it go? I remember you were particularly concerned about the ROI section. Also, Sarah from marketing had asked you to loop her in on the final version - should I remind you to send it to her?\\\"\\n\\nUser: \\\"What's on my plate today?\\\"\\nAssistant: \\\"Let me check your calendar and tasks... You have the team standup at 10 AM and client call at 2 PM. Also, a few things to flag: \\n- You wanted to follow up with Lisa about the contract (it's been 5 days)\\n- The project proposal for ABC Corp is due end of week\\n- You mentioned wanting to schedule your quarterly review with your manager\\nShould I help you tackle any of these today?\\\"\\n</example_interactions>\\n</proactive_assistance>\\n</other_tools>\\nPlease deliver the response in plain text without any Markdown or formatting. Provide the output as raw text.\\n</instructions>\\n\\nit's currently {{ $now }}  and the user lives in Europe/Berlin\",\n              \"maxIterations\": 100,\n              \"returnIntermediateSteps\": true\n            }\n          },\n          \"type\": \"@n8n/n8n-nodes-langchain.agent\",\n          \"typeVersion\": 2.1,\n          \"position\": [\n            1376,\n            384\n          ],\n          \"id\": \"128d6af6-04ee-41a9-9437-8d7934fb10fc\",\n          \"name\": \"AI Agent\"\n        },\n        {\n          \"parameters\": {\n            \"description\": \"Use this tool to read, access update and delete notes. Notes have a relation with tags (although it is not a must). List all tags before using tags.\",\n            \"workflowId\": {\n              \"__rl\": true,\n              \"mode\": \"id\",\n              \"value\": \"cowlU6kpyKlzrjBB\"\n            },\n            \"workflowInputs\": {\n              \"mappingMode\": \"defineBelow\",\n              \"value\": {\n                \"action\": \"={{ $fromAI('action', 'The operation to perform. Must be one of: create, read, update, delete, list', 'string', 'create') }}\",\n                \"user_telegram_id\": \"={{ $('set user and chat id').item.json.telegram_user_id }}\",\n                \"chat_telegram_id\": \"={{ $('Edit Fields1').item.json.telegram_chat_id }}\",\n                \"note_id\": \"={{ $fromAI('note_id', 'Note ID - Required for read, update, and delete actions. For other actions use: -1', 'number', -1) }}\",\n                \"title\": \"={{ $fromAI('title', 'Title of the note - optional for create/update. If not provided use: SKIP_FIELD', 'string', 'SKIP_FIELD') }}\",\n                \"content\": \"={{ $fromAI('content', 'Content of the note - required for create, optional for update. If not provided use: SKIP_FIELD', 'string', 'SKIP_FIELD') }}\",\n                \"note_type\": \"={{ $fromAI('note_type', 'Type of note: general (default), meeting, reminder, or task. If not specified use: SKIP_FIELD', 'string', 'SKIP_FIELD') }}\",\n                \"tags\": \"={{ $fromAI('tags', 'Tags for categorization - comma separated string like: work,urgent,important. IMPORTANT: use list tags before applying any. Any non-existing tag will block storing of notes. If no tags use: SKIP_FIELD', 'string', 'SKIP_FIELD') }}\",\n                \"metadata\": \"={{ $fromAI('metadata', 'Additional metadata as JSON string. If none use: SKIP_FIELD', 'string', 'SKIP_FIELD') }}\",\n                \"limit\": \"={{ $fromAI('limit', 'Maximum results for list action (default 10). For non-list actions use: -1', 'number', -1) }}\",\n                \"offset\": \"={{ $fromAI('offset', 'Offset for pagination in list action (default 0). For non-list actions use: -1', 'number', -1) }}\"\n              },\n              \"matchingColumns\": [],\n              \"schema\": [\n                {\n                  \"id\": \"action\",\n                  \"displayName\": \"action\",\n                  \"required\": false,\n                  \"defaultMatch\": false,\n                  \"display\": true,\n                  \"canBeUsedToMatch\": true,\n                  \"type\": \"string\"\n                },\n                {\n                  \"id\": \"user_telegram_id\",\n                  \"displayName\": \"user_telegram_id\",\n                  \"required\": false,\n                  \"defaultMatch\": false,\n                  \"display\": true,\n                  \"canBeUsedToMatch\": true,\n                  \"type\": \"string\"\n                },\n                {\n                  \"id\": \"chat_telegram_id\",\n                  \"displayName\": \"chat_telegram_id\",\n                  \"required\": false,\n                  \"defaultMatch\": false,\n                  \"display\": true,\n                  \"canBeUsedToMatch\": true,\n                  \"type\": \"string\"\n                },\n                {\n                  \"id\": \"note_id\",\n                  \"displayName\": \"note_id\",\n                  \"required\": false,\n                  \"defaultMatch\": false,\n                  \"display\": true,\n                  \"canBeUsedToMatch\": true,\n                  \"type\": \"number\"\n                },\n                {\n                  \"id\": \"title\",\n                  \"displayName\": \"title\",\n                  \"required\": false,\n                  \"defaultMatch\": false,\n                  \"display\": true,\n                  \"canBeUsedToMatch\": true,\n                  \"type\": \"string\"\n                },\n                {\n                  \"id\": \"content\",\n                  \"displayName\": \"content\",\n                  \"required\": false,\n                  \"defaultMatch\": false,\n                  \"display\": true,\n                  \"canBeUsedToMatch\": true,\n                  \"type\": \"string\"\n                },\n                {\n                  \"id\": \"note_type\",\n                  \"displayName\": \"note_type\",\n                  \"required\": false,\n                  \"defaultMatch\": false,\n                  \"display\": true,\n                  \"canBeUsedToMatch\": true,\n                  \"type\": \"string\"\n                },\n                {\n                  \"id\": \"tags\",\n                  \"displayName\": \"tags\",\n                  \"required\": false,\n                  \"defaultMatch\": false,\n                  \"display\": true,\n                  \"canBeUsedToMatch\": true,\n                  \"type\": \"string\"\n                },\n                {\n                  \"id\": \"metadata\",\n                  \"displayName\": \"metadata\",\n                  \"required\": false,\n                  \"defaultMatch\": false,\n                  \"display\": true,\n                  \"canBeUsedToMatch\": true,\n                  \"type\": \"string\"\n                },\n                {\n                  \"id\": \"limit\",\n                  \"displayName\": \"limit\",\n                  \"required\": false,\n                  \"defaultMatch\": false,\n                  \"display\": true,\n                  \"canBeUsedToMatch\": true,\n                  \"type\": \"number\"\n                },\n                {\n                  \"id\": \"offset\",\n                  \"displayName\": \"offset\",\n                  \"required\": false,\n                  \"defaultMatch\": false,\n                  \"display\": true,\n                  \"canBeUsedToMatch\": true,\n                  \"type\": \"number\"\n                }\n              ],\n              \"attemptToConvertTypes\": false,\n              \"convertFieldsToString\": false\n            }\n          },\n          \"type\": \"@n8n/n8n-nodes-langchain.toolWorkflow\",\n          \"typeVersion\": 2.2,\n          \"position\": [\n            1216,\n            992\n          ],\n          \"id\": \"fc891847-7be4-427a-bf0c-fbaa3da2bfa5\",\n          \"name\": \"CRUD NOTES\"\n        },\n        {\n          \"parameters\": {\n            \"description\": \"Search through stored messages, notes, and images using semantic or keyword search with various filters\",\n            \"workflowId\": {\n              \"__rl\": true,\n              \"mode\": \"id\",\n              \"value\": \"I5LevopKSmC5UYNa\"\n            },\n            \"workflowInputs\": {\n              \"mappingMode\": \"defineBelow\",\n              \"value\": {\n                \"user_telegram_id\": \"={{ $('set user and chat id').item.json.telegram_user_id }}\",\n                \"search_query\": \"={{ $fromAI('search_query', 'The text to search for in stored content. Can be empty for browsing all content. If not searching use: SKIP_FIELD', 'string', 'SKIP_FIELD') }}\",\n                \"search_type\": \"={{ $fromAI('search_type', 'Type of search: semantic (default, finds similar meaning) or keyword (exact text match). If not specified use: SKIP_FIELD', 'string', 'SKIP_FIELD') }}\",\n                \"content_type\": \"={{ $fromAI('content_type', 'Filter by content type: messages, notes, or images. Leave empty to search all types. If not filtering use: SKIP_FIELD', 'string', 'SKIP_FIELD') }}\",\n                \"start_date\": \"={{ $fromAI('start_date', 'Filter results from this date in YYYY-MM-DD format (e.g., 2025-01-15). If not filtering by start date use: SKIP_FIELD', 'string', 'SKIP_FIELD') }}\",\n                \"end_date\": \"={{ $fromAI('end_date', 'Filter results up to this date in YYYY-MM-DD format (e.g., 2025-07-22). If not filtering by end date use: SKIP_FIELD', 'string', 'SKIP_FIELD') }}\",\n                \"sender_type\": \"={{ $fromAI('sender_type', 'Filter messages by sender: user or bot. Only applies to messages. If not filtering use: SKIP_FIELD', 'string', 'SKIP_FIELD') }}\",\n                \"note_type\": \"={{ $fromAI('note_type', 'Filter notes by type: general, meeting, reminder, or task. Only applies when content_type is notes. If not filtering use: SKIP_FIELD', 'string', 'SKIP_FIELD') }}\",\n                \"has_tags\": \"={{ $fromAI('has_tags', 'Results must have ALL of these tags - provide as comma-separated string like: work,important,urgent. If no tag filtering use: SKIP_FIELD', 'string', 'SKIP_FIELD') }}\",\n                \"has_any_tags\": \"={{ $fromAI('has_any_tags', 'Results must have AT LEAST ONE of these tags - provide as comma-separated string like: personal,hobby,fun. If no tag filtering use: SKIP_FIELD', 'string', 'SKIP_FIELD') }}\",\n                \"limit\": \"={{ $fromAI('limit', 'Maximum number of results to return. Default is 50, max is 100. Use -1 for default', 'number', -1) }}\",\n                \"similarity_threshold\": \"={{ $fromAI('similarity_threshold', 'Minimum similarity score for semantic search between 0.0 and 1.0. Default is 0.2. Lower values return more results. Use -1 for default', 'number', -1) }}\"\n              },\n              \"matchingColumns\": [],\n              \"schema\": [\n                {\n                  \"id\": \"user_telegram_id\",\n                  \"displayName\": \"user_telegram_id\",\n                  \"required\": false,\n                  \"defaultMatch\": false,\n                  \"display\": true,\n                  \"canBeUsedToMatch\": true,\n                  \"type\": \"string\"\n                },\n                {\n                  \"id\": \"search_query\",\n                  \"displayName\": \"search_query\",\n                  \"required\": false,\n                  \"defaultMatch\": false,\n                  \"display\": true,\n                  \"canBeUsedToMatch\": true,\n                  \"type\": \"string\"\n                },\n                {\n                  \"id\": \"search_type\",\n                  \"displayName\": \"search_type\",\n                  \"required\": false,\n                  \"defaultMatch\": false,\n                  \"display\": true,\n                  \"canBeUsedToMatch\": true,\n                  \"type\": \"string\"\n                },\n                {\n                  \"id\": \"content_type\",\n                  \"displayName\": \"content_type\",\n                  \"required\": false,\n                  \"defaultMatch\": false,\n                  \"display\": true,\n                  \"canBeUsedToMatch\": true,\n                  \"type\": \"string\"\n                },\n                {\n                  \"id\": \"start_date\",\n                  \"displayName\": \"start_date\",\n                  \"required\": false,\n                  \"defaultMatch\": false,\n                  \"display\": true,\n                  \"canBeUsedToMatch\": true,\n                  \"type\": \"string\"\n                },\n                {\n                  \"id\": \"end_date\",\n                  \"displayName\": \"end_date\",\n                  \"required\": false,\n                  \"defaultMatch\": false,\n                  \"display\": true,\n                  \"canBeUsedToMatch\": true,\n                  \"type\": \"string\"\n                },\n                {\n                  \"id\": \"sender_type\",\n                  \"displayName\": \"sender_type\",\n                  \"required\": false,\n                  \"defaultMatch\": false,\n                  \"display\": true,\n                  \"canBeUsedToMatch\": true,\n                  \"type\": \"string\"\n                },\n                {\n                  \"id\": \"note_type\",\n                  \"displayName\": \"note_type\",\n                  \"required\": false,\n                  \"defaultMatch\": false,\n                  \"display\": true,\n                  \"canBeUsedToMatch\": true,\n                  \"type\": \"string\"\n                },\n                {\n                  \"id\": \"has_tags\",\n                  \"displayName\": \"has_tags\",\n                  \"required\": false,\n                  \"defaultMatch\": false,\n                  \"display\": true,\n                  \"canBeUsedToMatch\": true,\n                  \"type\": \"string\"\n                },\n                {\n                  \"id\": \"has_any_tags\",\n                  \"displayName\": \"has_any_tags\",\n                  \"required\": false,\n                  \"defaultMatch\": false,\n                  \"display\": true,\n                  \"canBeUsedToMatch\": true,\n                  \"type\": \"string\"\n                },\n                {\n                  \"id\": \"limit\",\n                  \"displayName\": \"limit\",\n                  \"required\": false,\n                  \"defaultMatch\": false,\n                  \"display\": true,\n                  \"canBeUsedToMatch\": true,\n                  \"type\": \"number\"\n                },\n                {\n                  \"id\": \"similarity_threshold\",\n                  \"displayName\": \"similarity_threshold\",\n                  \"required\": false,\n                  \"defaultMatch\": false,\n                  \"display\": true,\n                  \"canBeUsedToMatch\": true,\n                  \"type\": \"number\"\n                }\n              ],\n              \"attemptToConvertTypes\": false,\n              \"convertFieldsToString\": false\n            }\n          },\n          \"type\": \"@n8n/n8n-nodes-langchain.toolWorkflow\",\n          \"typeVersion\": 2.2,\n          \"position\": [\n            1408,\n            896\n          ],\n          \"id\": \"a4c76ec0-53cc-450d-b4d6-27f96b3f3fa3\",\n          \"name\": \"Search Memory Tool\"\n        },\n        {\n          \"parameters\": {\n            \"workflowId\": {\n              \"__rl\": true,\n              \"mode\": \"id\",\n              \"value\": \"16tHqWBFpARbSmuK\"\n            },\n            \"workflowInputs\": {\n              \"mappingMode\": \"defineBelow\",\n              \"value\": {\n                \"action\": \"={{ $fromAI('action', 'The operation to perform. Must be one of: create, read, update, delete, list', 'string', 'create') }}\",\n                \"user_telegram_id\": \"={{ $('set user and chat id').item.json.telegram_user_id }}\",\n                \"contact_id\": \"={{ $fromAI('contact_id', 'Contact ID - Required for read, update, and delete actions. For other actions use: -1', 'number', -1) }}\",\n                \"first_name\": \"={{ $fromAI('first_name', 'Contact\\\\'s first name. If not provided use: SKIP_FIELD', 'string', 'SKIP_FIELD') }}\",\n                \"last_name\": \"={{ $fromAI('last_name', 'Contact\\\\'s last name. If not provided use: SKIP_FIELD', 'string', 'SKIP_FIELD') }}\",\n                \"nickname\": \"={{ $fromAI('nickname', 'Nickname or preferred name. If not provided use: SKIP_FIELD', 'string', 'SKIP_FIELD') }}\",\n                \"email\": \"={{ $fromAI('email', 'Contact\\\\'s email address. If not provided use: SKIP_FIELD', 'string', 'SKIP_FIELD') }}\",\n                \"phone_number\": \"={{ $fromAI('phone_number', 'Primary phone number. If not provided use: SKIP_FIELD', 'string', 'SKIP_FIELD') }}\",\n                \"phone_number_alt\": \"={{ $fromAI('phone_number_alt', 'Alternative phone number. If not provided use: SKIP_FIELD', 'string', 'SKIP_FIELD') }}\",\n                \"birthday\": \"={{ $fromAI('birthday', 'Contact\\\\'s birthday (YYYY-MM-DD). If not provided use: SKIP_FIELD', 'string', 'SKIP_FIELD') }}\",\n                \"company\": \"={{ $fromAI('company', 'Company or organization. If not provided use: SKIP_FIELD', 'string', 'SKIP_FIELD') }}\",\n                \"job_title\": \"={{ $fromAI('job_title', 'Job title or role. If not provided use: SKIP_FIELD', 'string', 'SKIP_FIELD') }}\",\n                \"relationship_type\": \"={{ $fromAI('relationship_type', 'Type of relationship (e.g., friend, colleague, family). If not provided use: SKIP_FIELD', 'string', 'SKIP_FIELD') }}\",\n                \"how_met\": \"={{ $fromAI('how_met', 'How you met this person. If not provided use: SKIP_FIELD', 'string', 'SKIP_FIELD') }}\",\n                \"notes\": \"={{ $fromAI('notes', 'Additional notes about the contact. If not provided use: SKIP_FIELD', 'string', 'SKIP_FIELD') }}\",\n                \"tags\": \"={{ $fromAI('tags', 'Tags for categorization - comma separated string like: work,personal,important. IMPORTANT: use list tags tool before applying any. Any non-existing tag will block storing of contacts. If no tags use: SKIP_FIELD', 'string', 'SKIP_FIELD') }}\",\n                \"telegram_username\": \"={{ $fromAI('telegram_username', 'Telegram username (without @). If not provided use: SKIP_FIELD', 'string', 'SKIP_FIELD') }}\",\n                \"telegram_id\": \"={{ $fromAI('telegram_id', 'Telegram user ID. If not provided use: SKIP_FIELD', 'string', 'SKIP_FIELD') }}\",\n                \"metadata\": \"={{ $fromAI('metadata', 'Additional metadata as JSON string. If none use: SKIP_FIELD', 'string', 'SKIP_FIELD') }}\",\n                \"limit\": \"={{ $fromAI('limit', 'Maximum results for list action (default 10). For non-list actions use: -1', 'number', -1) }}\",\n                \"offset\": \"={{ $fromAI('offset', 'Offset for pagination in list action (default 0). For non-list actions use: -1', 'number', -1) }}\"\n              },\n              \"matchingColumns\": [],\n              \"schema\": [\n                {\n                  \"id\": \"action\",\n                  \"displayName\": \"action\",\n                  \"required\": false,\n                  \"defaultMatch\": false,\n                  \"display\": true,\n                  \"canBeUsedToMatch\": true,\n                  \"type\": \"string\"\n                },\n                {\n                  \"id\": \"user_telegram_id\",\n                  \"displayName\": \"user_telegram_id\",\n                  \"required\": false,\n                  \"defaultMatch\": false,\n                  \"display\": true,\n                  \"canBeUsedToMatch\": true,\n                  \"type\": \"string\"\n                },\n                {\n                  \"id\": \"contact_id\",\n                  \"displayName\": \"contact_id\",\n                  \"required\": false,\n                  \"defaultMatch\": false,\n                  \"display\": true,\n                  \"canBeUsedToMatch\": true,\n                  \"type\": \"number\"\n                },\n                {\n                  \"id\": \"first_name\",\n                  \"displayName\": \"first_name\",\n                  \"required\": false,\n                  \"defaultMatch\": false,\n                  \"display\": true,\n                  \"canBeUsedToMatch\": true,\n                  \"type\": \"string\"\n                },\n                {\n                  \"id\": \"last_name\",\n                  \"displayName\": \"last_name\",\n                  \"required\": false,\n                  \"defaultMatch\": false,\n                  \"display\": true,\n                  \"canBeUsedToMatch\": true,\n                  \"type\": \"string\"\n                },\n                {\n                  \"id\": \"nickname\",\n                  \"displayName\": \"nickname\",\n                  \"required\": false,\n                  \"defaultMatch\": false,\n                  \"display\": true,\n                  \"canBeUsedToMatch\": true,\n                  \"type\": \"string\"\n                },\n                {\n                  \"id\": \"email\",\n                  \"displayName\": \"email\",\n                  \"required\": false,\n                  \"defaultMatch\": false,\n                  \"display\": true,\n                  \"canBeUsedToMatch\": true,\n                  \"type\": \"string\"\n                },\n                {\n                  \"id\": \"phone_number\",\n                  \"displayName\": \"phone_number\",\n                  \"required\": false,\n                  \"defaultMatch\": false,\n                  \"display\": true,\n                  \"canBeUsedToMatch\": true,\n                  \"type\": \"string\"\n                },\n                {\n                  \"id\": \"phone_number_alt\",\n                  \"displayName\": \"phone_number_alt\",\n                  \"required\": false,\n                  \"defaultMatch\": false,\n                  \"display\": true,\n                  \"canBeUsedToMatch\": true,\n                  \"type\": \"string\"\n                },\n                {\n                  \"id\": \"birthday\",\n                  \"displayName\": \"birthday\",\n                  \"required\": false,\n                  \"defaultMatch\": false,\n                  \"display\": true,\n                  \"canBeUsedToMatch\": true,\n                  \"type\": \"string\"\n                },\n                {\n                  \"id\": \"company\",\n                  \"displayName\": \"company\",\n                  \"required\": false,\n                  \"defaultMatch\": false,\n                  \"display\": true,\n                  \"canBeUsedToMatch\": true,\n                  \"type\": \"string\"\n                },\n                {\n                  \"id\": \"job_title\",\n                  \"displayName\": \"job_title\",\n                  \"required\": false,\n                  \"defaultMatch\": false,\n                  \"display\": true,\n                  \"canBeUsedToMatch\": true,\n                  \"type\": \"string\"\n                },\n                {\n                  \"id\": \"relationship_type\",\n                  \"displayName\": \"relationship_type\",\n                  \"required\": false,\n                  \"defaultMatch\": false,\n                  \"display\": true,\n                  \"canBeUsedToMatch\": true,\n                  \"type\": \"string\"\n                },\n                {\n                  \"id\": \"how_met\",\n                  \"displayName\": \"how_met\",\n                  \"required\": false,\n                  \"defaultMatch\": false,\n                  \"display\": true,\n                  \"canBeUsedToMatch\": true,\n                  \"type\": \"string\"\n                },\n                {\n                  \"id\": \"notes\",\n                  \"displayName\": \"notes\",\n                  \"required\": false,\n                  \"defaultMatch\": false,\n                  \"display\": true,\n                  \"canBeUsedToMatch\": true,\n                  \"type\": \"string\"\n                },\n                {\n                  \"id\": \"tags\",\n                  \"displayName\": \"tags\",\n                  \"required\": false,\n                  \"defaultMatch\": false,\n                  \"display\": true,\n                  \"canBeUsedToMatch\": true,\n                  \"type\": \"string\"\n                },\n                {\n                  \"id\": \"telegram_username\",\n                  \"displayName\": \"telegram_username\",\n                  \"required\": false,\n                  \"defaultMatch\": false,\n                  \"display\": true,\n                  \"canBeUsedToMatch\": true,\n                  \"type\": \"string\"\n                },\n                {\n                  \"id\": \"telegram_id\",\n                  \"displayName\": \"telegram_id\",\n                  \"required\": false,\n                  \"defaultMatch\": false,\n                  \"display\": true,\n                  \"canBeUsedToMatch\": true,\n                  \"type\": \"string\"\n                },\n                {\n                  \"id\": \"metadata\",\n                  \"displayName\": \"metadata\",\n                  \"required\": false,\n                  \"defaultMatch\": false,\n                  \"display\": true,\n                  \"canBeUsedToMatch\": true,\n                  \"type\": \"string\"\n                },\n                {\n                  \"id\": \"limit\",\n                  \"displayName\": \"limit\",\n                  \"required\": false,\n                  \"defaultMatch\": false,\n                  \"display\": true,\n                  \"canBeUsedToMatch\": true,\n                  \"type\": \"number\"\n                },\n                {\n                  \"id\": \"offset\",\n                  \"displayName\": \"offset\",\n                  \"required\": false,\n                  \"defaultMatch\": false,\n                  \"display\": true,\n                  \"canBeUsedToMatch\": true,\n                  \"type\": \"number\"\n                }\n              ],\n              \"attemptToConvertTypes\": false,\n              \"convertFieldsToString\": false\n            }\n          },\n          \"type\": \"@n8n/n8n-nodes-langchain.toolWorkflow\",\n          \"typeVersion\": 2.2,\n          \"position\": [\n            1536,\n            1168\n          ],\n          \"id\": \"7b8862b6-bfc1-4382-98be-2497286b9a78\",\n          \"name\": \"Store a contact\"\n        },\n        {\n          \"parameters\": {\n            \"workflowId\": {\n              \"__rl\": true,\n              \"mode\": \"id\",\n              \"value\": \"JV1WZzfbD7pPaEo9\"\n            },\n            \"workflowInputs\": {\n              \"mappingMode\": \"defineBelow\",\n              \"value\": {\n                \"user_telegram_id\": \"={{ $('set user and chat id').item.json.telegram_user_id }}\",\n                \"image_id\": \"={{ $fromAI('image_id', 'The database ID of the image to query (required)', 'number') }}\",\n                \"prompt\": \"={{ $fromAI('prompt', 'The question or prompt about the image (required)', 'string') }}\",\n                \"include_original_description\": \"={{ $fromAI('include_original_description', 'Include the original AI description as context (default: true)', 'boolean', true) }}\",\n                \"model\": \"={{ $fromAI('model', 'The AI model to use (default: gpt-4.1-mini). Leave empty unless otherwise specified. Never use GPT-4-vision or GPT-4.', 'string', 'gpt-4.1-mini') }}\"\n              },\n              \"matchingColumns\": [],\n              \"schema\": [\n                {\n                  \"id\": \"user_telegram_id\",\n                  \"displayName\": \"user_telegram_id\",\n                  \"required\": false,\n                  \"defaultMatch\": false,\n                  \"display\": true,\n                  \"canBeUsedToMatch\": true,\n                  \"type\": \"string\"\n                },\n                {\n                  \"id\": \"image_id\",\n                  \"displayName\": \"image_id\",\n                  \"required\": false,\n                  \"defaultMatch\": false,\n                  \"display\": true,\n                  \"canBeUsedToMatch\": true,\n                  \"type\": \"number\"\n                },\n                {\n                  \"id\": \"prompt\",\n                  \"displayName\": \"prompt\",\n                  \"required\": false,\n                  \"defaultMatch\": false,\n                  \"display\": true,\n                  \"canBeUsedToMatch\": true,\n                  \"type\": \"string\"\n                },\n                {\n                  \"id\": \"include_original_description\",\n                  \"displayName\": \"include_original_description\",\n                  \"required\": false,\n                  \"defaultMatch\": false,\n                  \"display\": true,\n                  \"canBeUsedToMatch\": true,\n                  \"type\": \"boolean\"\n                },\n                {\n                  \"id\": \"model\",\n                  \"displayName\": \"model\",\n                  \"required\": false,\n                  \"defaultMatch\": false,\n                  \"display\": true,\n                  \"canBeUsedToMatch\": true,\n                  \"type\": \"string\"\n                }\n              ],\n              \"attemptToConvertTypes\": false,\n              \"convertFieldsToString\": false\n            }\n          },\n          \"type\": \"@n8n/n8n-nodes-langchain.toolWorkflow\",\n          \"typeVersion\": 2.2,\n          \"position\": [\n            1760,\n            1104\n          ],\n          \"id\": \"949b0aef-d1f6-4821-8565-bde537d48937\",\n          \"name\": \"QUERY IMAGE\"\n        },\n        {\n          \"parameters\": {\n            \"workflowId\": {\n              \"__rl\": true,\n              \"mode\": \"id\",\n              \"value\": \"wgpRU5QeHNN46A98\"\n            },\n            \"workflowInputs\": {\n              \"mappingMode\": \"defineBelow\",\n              \"value\": {\n                \"action\": \"={{ $fromAI('action', 'Action to perform: create, list, get, update, delete, search_similar. Default is list', 'string', 'list') }}\",\n                \"tag_name\": \"={{ $fromAI('tag_name', 'The name of the tag (will be lowercased automatically). If not provided use: SKIP_FIELD', 'string', 'SKIP_FIELD') }}\",\n                \"description\": \"={{ $fromAI('description', 'Description/explanation of what the tag is for. If not provided use: SKIP_FIELD', 'string', 'SKIP_FIELD') }}\",\n                \"category\": \"={{ $fromAI('category', 'Category of the tag (e.g., business, technology, ai, productivity). If not provided use: SKIP_FIELD', 'string', 'SKIP_FIELD') }}\",\n                \"created_by\": \"={{ $('set user and chat id').item.json.telegram_user_id }}\",\n                \"search\": \"={{ $fromAI('search', 'Search term for list or search_similar actions. If not provided use: SKIP_FIELD', 'string', 'SKIP_FIELD') }}\",\n                \"threshold\": \"={{ $fromAI('threshold', 'Minimum similarity for search_similar (0.0 to 1.0, default: 0.3). For non-search actions use: -1', 'number', -1) }}\"\n              },\n              \"matchingColumns\": [],\n              \"schema\": [\n                {\n                  \"id\": \"action\",\n                  \"displayName\": \"action\",\n                  \"required\": false,\n                  \"defaultMatch\": false,\n                  \"display\": true,\n                  \"canBeUsedToMatch\": true,\n                  \"type\": \"string\"\n                },\n                {\n                  \"id\": \"tag_name\",\n                  \"displayName\": \"tag_name\",\n                  \"required\": false,\n                  \"defaultMatch\": false,\n                  \"display\": true,\n                  \"canBeUsedToMatch\": true,\n                  \"type\": \"string\"\n                },\n                {\n                  \"id\": \"description\",\n                  \"displayName\": \"description\",\n                  \"required\": false,\n                  \"defaultMatch\": false,\n                  \"display\": true,\n                  \"canBeUsedToMatch\": true,\n                  \"type\": \"string\"\n                },\n                {\n                  \"id\": \"category\",\n                  \"displayName\": \"category\",\n                  \"required\": false,\n                  \"defaultMatch\": false,\n                  \"display\": true,\n                  \"canBeUsedToMatch\": true,\n                  \"type\": \"string\"\n                },\n                {\n                  \"id\": \"created_by\",\n                  \"displayName\": \"created_by\",\n                  \"required\": false,\n                  \"defaultMatch\": false,\n                  \"display\": true,\n                  \"canBeUsedToMatch\": true,\n                  \"type\": \"string\"\n                },\n                {\n                  \"id\": \"search\",\n                  \"displayName\": \"search\",\n                  \"required\": false,\n                  \"defaultMatch\": false,\n                  \"display\": true,\n                  \"canBeUsedToMatch\": true,\n                  \"type\": \"string\"\n                },\n                {\n                  \"id\": \"threshold\",\n                  \"displayName\": \"threshold\",\n                  \"required\": false,\n                  \"defaultMatch\": false,\n                  \"display\": true,\n                  \"canBeUsedToMatch\": true,\n                  \"type\": \"number\"\n                }\n              ],\n              \"attemptToConvertTypes\": false,\n              \"convertFieldsToString\": false\n            }\n          },\n          \"type\": \"@n8n/n8n-nodes-langchain.toolWorkflow\",\n          \"typeVersion\": 2.2,\n          \"position\": [\n            2048,\n            1008\n          ],\n          \"id\": \"84b8e2c1-4d0f-433e-aaef-ba01c7457683\",\n          \"name\": \"Manage Tags\"\n        },\n        {\n          \"parameters\": {\n            \"workflowId\": {\n              \"__rl\": true,\n              \"mode\": \"id\",\n              \"value\": \"iGHGkhJfZFbyDK5v\"\n            },\n            \"workflowInputs\": {\n              \"mappingMode\": \"defineBelow\",\n              \"value\": {\n                \"action\": \"={{ $fromAI('action', 'Action to perform: create, list, get, update, delete, toggle. Default is list', 'string', 'list') }}\",\n                \"user_telegram_id\": \"={{ $('set user and chat id').item.json.telegram_user_id }}\",\n                \"task_id\": \"={{ $fromAI('task_id', 'Task ID - Required for get, update, delete, and toggle actions. For other actions use: -1', 'number', -1) }}\",\n                \"prompt\": \"={{ $fromAI('prompt', 'The message/prompt to send when the task is triggered. If not provided use: SKIP_FIELD', 'string', 'SKIP_FIELD') }}\",\n                \"schedule\": \"={{ $fromAI('schedule', 'Cron expression (e.g., \\\"0 9 * * *\\\" for daily at 9am, \\\"0 * * * *\\\" for hourly). If not provided use: SKIP_FIELD', 'string', 'SKIP_FIELD') }}\",\n                \"timezone\": \"={{ $fromAI('timezone', 'User timezone (e.g., Europe/Amsterdam, America/New_York, Asia/Singapore). If not specified use: SKIP_FIELD', 'string', 'SKIP_FIELD') }}\",\n                \"is_active\": \"={{ $fromAI('is_active', 'Whether the task is active. true or false. If not specified use: SKIP_FIELD', 'string', 'SKIP_FIELD') }}\",\n                \"is_one_time\": \"={{ $fromAI('is_one_time', 'Set to true if it is a one time reminder (or simply a task) - is archived automatically. If not specified use: SKIP_FIELD', 'string', 'SKIP_FIELD') }}\",\n                \"metadata\": \"={{ $fromAI('metadata', 'Additional metadata as JSON string. If none use: SKIP_FIELD', 'string', 'SKIP_FIELD') }}\"\n              },\n              \"matchingColumns\": [],\n              \"schema\": [\n                {\n                  \"id\": \"action\",\n                  \"displayName\": \"action\",\n                  \"required\": false,\n                  \"defaultMatch\": false,\n                  \"display\": true,\n                  \"canBeUsedToMatch\": true,\n                  \"type\": \"string\"\n                },\n                {\n                  \"id\": \"user_telegram_id\",\n                  \"displayName\": \"user_telegram_id\",\n                  \"required\": false,\n                  \"defaultMatch\": false,\n                  \"display\": true,\n                  \"canBeUsedToMatch\": true,\n                  \"type\": \"string\"\n                },\n                {\n                  \"id\": \"task_id\",\n                  \"displayName\": \"task_id\",\n                  \"required\": false,\n                  \"defaultMatch\": false,\n                  \"display\": true,\n                  \"canBeUsedToMatch\": true,\n                  \"type\": \"number\"\n                },\n                {\n                  \"id\": \"prompt\",\n                  \"displayName\": \"prompt\",\n                  \"required\": false,\n                  \"defaultMatch\": false,\n                  \"display\": true,\n                  \"canBeUsedToMatch\": true,\n                  \"type\": \"string\"\n                },\n                {\n                  \"id\": \"schedule\",\n                  \"displayName\": \"schedule\",\n                  \"required\": false,\n                  \"defaultMatch\": false,\n                  \"display\": true,\n                  \"canBeUsedToMatch\": true,\n                  \"type\": \"string\"\n                },\n                {\n                  \"id\": \"timezone\",\n                  \"displayName\": \"timezone\",\n                  \"required\": false,\n                  \"defaultMatch\": false,\n                  \"display\": true,\n                  \"canBeUsedToMatch\": true,\n                  \"type\": \"string\"\n                },\n                {\n                  \"id\": \"is_active\",\n                  \"displayName\": \"is_active\",\n                  \"required\": false,\n                  \"defaultMatch\": false,\n                  \"display\": true,\n                  \"canBeUsedToMatch\": true,\n                  \"type\": \"string\"\n                },\n                {\n                  \"id\": \"is_one_time\",\n                  \"displayName\": \"is_one_time\",\n                  \"required\": false,\n                  \"defaultMatch\": false,\n                  \"display\": true,\n                  \"canBeUsedToMatch\": true,\n                  \"type\": \"string\"\n                },\n                {\n                  \"id\": \"metadata\",\n                  \"displayName\": \"metadata\",\n                  \"required\": false,\n                  \"defaultMatch\": false,\n                  \"display\": true,\n                  \"canBeUsedToMatch\": true,\n                  \"type\": \"string\"\n                }\n              ],\n              \"attemptToConvertTypes\": false,\n              \"convertFieldsToString\": false\n            }\n          },\n          \"type\": \"@n8n/n8n-nodes-langchain.toolWorkflow\",\n          \"typeVersion\": 2.2,\n          \"position\": [\n            2336,\n            1024\n          ],\n          \"id\": \"ad4b175a-3f25-4854-845d-44a861dcce22\",\n          \"name\": \"Manage Scheduled Tasks\"\n        },\n        {\n          \"parameters\": {\n            \"assignments\": {\n              \"assignments\": [\n                {\n                  \"id\": \"d6764455-84ed-489a-8a76-3f818a8e8313\",\n                  \"name\": \"message\",\n                  \"value\": \"={{ $json.output }}\",\n                  \"type\": \"string\"\n                },\n                {\n                  \"id\": \"13416f98-38ac-4080-bdd6-715bdd4d5c54\",\n                  \"name\": \"telegram_chat_id\",\n                  \"value\": \"={{ $('set user and chat id').item.json.telegram_user_id }}\",\n                  \"type\": \"string\"\n                }\n              ]\n            },\n            \"options\": {}\n          },\n          \"type\": \"n8n-nodes-base.set\",\n          \"typeVersion\": 3.4,\n          \"position\": [\n            2048,\n            608\n          ],\n          \"id\": \"9cf1dab9-812e-41d7-a2d6-60e40aaf216e\",\n          \"name\": \"Edit Fields\"\n        },\n        {\n          \"parameters\": {\n            \"workflowId\": {\n              \"__rl\": true,\n              \"mode\": \"id\",\n              \"value\": \"NC6LvdJ5EiozwYHi\"\n            },\n            \"workflowInputs\": {\n              \"mappingMode\": \"defineBelow\",\n              \"value\": {\n                \"user_telegram_id\": \"={{ $('set user and chat id').item.json.telegram_user_id }}\",\n                \"chat_telegram_id\": \"={{ $('set user and chat id').item.json.telegram_chat_id }}\",\n                \"message_id\": \"={{ $('set user and chat id').item.json.message_id }}\",\n                \"message_text\": \"={{ $('set user and chat id').item.json.prompt }}\",\n                \"sender_type\": \"user\",\n                \"metadata\": \"{}\"\n              },\n              \"matchingColumns\": [],\n              \"schema\": [\n                {\n                  \"id\": \"user_telegram_id\",\n                  \"displayName\": \"user_telegram_id\",\n                  \"required\": false,\n                  \"defaultMatch\": false,\n                  \"display\": true,\n                  \"canBeUsedToMatch\": true,\n                  \"type\": \"string\"\n                },\n                {\n                  \"id\": \"chat_telegram_id\",\n                  \"displayName\": \"chat_telegram_id\",\n                  \"required\": false,\n                  \"defaultMatch\": false,\n                  \"display\": true,\n                  \"canBeUsedToMatch\": true,\n                  \"type\": \"string\"\n                },\n                {\n                  \"id\": \"message_id\",\n                  \"displayName\": \"message_id\",\n                  \"required\": false,\n                  \"defaultMatch\": false,\n                  \"display\": true,\n                  \"canBeUsedToMatch\": true,\n                  \"type\": \"number\"\n                },\n                {\n                  \"id\": \"message_text\",\n                  \"displayName\": \"message_text\",\n                  \"required\": false,\n                  \"defaultMatch\": false,\n                  \"display\": true,\n                  \"canBeUsedToMatch\": true,\n                  \"type\": \"string\"\n                },\n                {\n                  \"id\": \"sender_type\",\n                  \"displayName\": \"sender_type\",\n                  \"required\": false,\n                  \"defaultMatch\": false,\n                  \"display\": true,\n                  \"canBeUsedToMatch\": true,\n                  \"type\": \"string\"\n                },\n                {\n                  \"id\": \"metadata\",\n                  \"displayName\": \"metadata\",\n                  \"required\": false,\n                  \"defaultMatch\": false,\n                  \"display\": true,\n                  \"canBeUsedToMatch\": true,\n                  \"type\": \"string\"\n                }\n              ],\n              \"attemptToConvertTypes\": false,\n              \"convertFieldsToString\": true\n            },\n            \"options\": {\n              \"waitForSubWorkflow\": false\n            }\n          },\n          \"type\": \"n8n-nodes-base.executeWorkflow\",\n          \"typeVersion\": 1.2,\n          \"position\": [\n            2064,\n            32\n          ],\n          \"id\": \"0cf59bbe-ac7e-46be-973a-794fa10be9fe\",\n          \"name\": \"Store user message\"\n        },\n        {\n          \"parameters\": {\n            \"workflowId\": {\n              \"__rl\": true,\n              \"mode\": \"id\",\n              \"value\": \"NC6LvdJ5EiozwYHi\"\n            },\n            \"workflowInputs\": {\n              \"mappingMode\": \"defineBelow\",\n              \"value\": {\n                \"user_telegram_id\": \"={{ $('set user and chat id').item.json.telegram_user_id }}\",\n                \"chat_telegram_id\": \"={{ $('set user and chat id').item.json.telegram_chat_id }}\",\n                \"message_id\": \"={{ $('set user and chat id').item.json.message.message_id }}\",\n                \"message_text\": \"={{ $json.output }}\",\n                \"sender_type\": \"bot\",\n                \"metadata\": \"{}\"\n              },\n              \"matchingColumns\": [],\n              \"schema\": [\n                {\n                  \"id\": \"user_telegram_id\",\n                  \"displayName\": \"user_telegram_id\",\n                  \"required\": false,\n                  \"defaultMatch\": false,\n                  \"display\": true,\n                  \"canBeUsedToMatch\": true,\n                  \"type\": \"string\"\n                },\n                {\n                  \"id\": \"chat_telegram_id\",\n                  \"displayName\": \"chat_telegram_id\",\n                  \"required\": false,\n                  \"defaultMatch\": false,\n                  \"display\": true,\n                  \"canBeUsedToMatch\": true,\n                  \"type\": \"string\"\n                },\n                {\n                  \"id\": \"message_id\",\n                  \"displayName\": \"message_id\",\n                  \"required\": false,\n                  \"defaultMatch\": false,\n                  \"display\": true,\n                  \"canBeUsedToMatch\": true,\n                  \"type\": \"number\"\n                },\n                {\n                  \"id\": \"message_text\",\n                  \"displayName\": \"message_text\",\n                  \"required\": false,\n                  \"defaultMatch\": false,\n                  \"display\": true,\n                  \"canBeUsedToMatch\": true,\n                  \"type\": \"string\"\n                },\n                {\n                  \"id\": \"sender_type\",\n                  \"displayName\": \"sender_type\",\n                  \"required\": false,\n                  \"defaultMatch\": false,\n                  \"display\": true,\n                  \"canBeUsedToMatch\": true,\n                  \"type\": \"string\"\n                },\n                {\n                  \"id\": \"metadata\",\n                  \"displayName\": \"metadata\",\n                  \"required\": false,\n                  \"defaultMatch\": false,\n                  \"display\": true,\n                  \"canBeUsedToMatch\": true,\n                  \"type\": \"string\"\n                }\n              ],\n              \"attemptToConvertTypes\": false,\n              \"convertFieldsToString\": true\n            },\n            \"options\": {\n              \"waitForSubWorkflow\": false\n            }\n          },\n          \"type\": \"n8n-nodes-base.executeWorkflow\",\n          \"typeVersion\": 1.2,\n          \"position\": [\n            2048,\n            256\n          ],\n          \"id\": \"21cf553a-eebc-40ba-8ada-986a2c2100dc\",\n          \"name\": \"Store bot message\"\n        },\n        {\n          \"parameters\": {\n            \"rules\": {\n              \"values\": [\n                {\n                  \"conditions\": {\n                    \"options\": {\n                      \"caseSensitive\": true,\n                      \"leftValue\": \"\",\n                      \"typeValidation\": \"strict\",\n                      \"version\": 2\n                    },\n                    \"conditions\": [\n                      {\n                        \"leftValue\": \"={{ $json.message.voice }}\",\n                        \"rightValue\": \"\",\n                        \"operator\": {\n                          \"type\": \"object\",\n                          \"operation\": \"exists\",\n                          \"singleValue\": true\n                        },\n                        \"id\": \"d59d9505-fef0-4496-8b83-1189a3be894a\"\n                      }\n                    ],\n                    \"combinator\": \"and\"\n                  },\n                  \"renameOutput\": true,\n                  \"outputKey\": \"voice\"\n                },\n                {\n                  \"conditions\": {\n                    \"options\": {\n                      \"caseSensitive\": true,\n                      \"leftValue\": \"\",\n                      \"typeValidation\": \"strict\",\n                      \"version\": 2\n                    },\n                    \"conditions\": [\n                      {\n                        \"id\": \"d7235f2a-c0c3-4737-9111-7ee0413701bf\",\n                        \"leftValue\": \"={{ $json.message.text }}\",\n                        \"rightValue\": \"\",\n                        \"operator\": {\n                          \"type\": \"string\",\n                          \"operation\": \"exists\",\n                          \"singleValue\": true\n                        }\n                      }\n                    ],\n                    \"combinator\": \"and\"\n                  },\n                  \"renameOutput\": true,\n                  \"outputKey\": \"text\"\n                },\n                {\n                  \"conditions\": {\n                    \"options\": {\n                      \"caseSensitive\": true,\n                      \"leftValue\": \"\",\n                      \"typeValidation\": \"strict\",\n                      \"version\": 2\n                    },\n                    \"conditions\": [\n                      {\n                        \"id\": \"e3bc74c0-99b5-40b5-a8bc-3f8457daff6f\",\n                        \"leftValue\": \"={{ $json.message.photo }}\",\n                        \"rightValue\": \"\",\n                        \"operator\": {\n                          \"type\": \"array\",\n                          \"operation\": \"exists\",\n                          \"singleValue\": true\n                        }\n                      }\n                    ],\n                    \"combinator\": \"and\"\n                  },\n                  \"renameOutput\": true,\n                  \"outputKey\": \"photo\"\n                }\n              ]\n            },\n            \"options\": {}\n          },\n          \"type\": \"n8n-nodes-base.switch\",\n          \"typeVersion\": 3.2,\n          \"position\": [\n            -128,\n            352\n          ],\n          \"id\": \"487e9685-6fbe-44ee-8b92-380ac6a73c75\",\n          \"name\": \"Switch\"\n        },\n        {\n          \"parameters\": {\n            \"resource\": \"audio\",\n            \"operation\": \"transcribe\",\n            \"options\": {}\n          },\n          \"type\": \"@n8n/n8n-nodes-langchain.openAi\",\n          \"typeVersion\": 1.8,\n          \"position\": [\n            336,\n            224\n          ],\n          \"id\": \"73745696-8185-4248-a936-345dff9f9b4e\",\n          \"name\": \"Transcribe a recording\",\n          \"credentials\": {\n            \"openAiApi\": {\n              \"id\": \"224l8PKoMiKAr2Bc\",\n              \"name\": \"OpenAi account\"\n            }\n          }\n        },\n        {\n          \"parameters\": {\n            \"resource\": \"file\",\n            \"fileId\": \"={{ $json.message.voice.file_id }}\",\n            \"additionalFields\": {}\n          },\n          \"type\": \"n8n-nodes-base.telegram\",\n          \"typeVersion\": 1.2,\n          \"position\": [\n            96,\n            224\n          ],\n          \"id\": \"8d1b19f5-ded0-41ec-930f-07d80f232384\",\n          \"name\": \"Download audio file\",\n          \"webhookId\": \"866adf69-1e6e-48e8-81ac-3ebdfceda472\",\n          \"credentials\": {\n            \"telegramApi\": {\n              \"id\": \"TBAkY5JzhaGMduny\",\n              \"name\": \"Telegram account\"\n            }\n          }\n        },\n        {\n          \"parameters\": {\n            \"resource\": \"file\",\n            \"fileId\": \"={{ $json.message.photo[3].file_id }}\",\n            \"additionalFields\": {}\n          },\n          \"type\": \"n8n-nodes-base.telegram\",\n          \"typeVersion\": 1.2,\n          \"position\": [\n            112,\n            496\n          ],\n          \"id\": \"9a754b1c-cbfa-45af-845c-95096ef4ff62\",\n          \"name\": \"Download image\",\n          \"webhookId\": \"866adf69-1e6e-48e8-81ac-3ebdfceda472\",\n          \"credentials\": {\n            \"telegramApi\": {\n              \"id\": \"TBAkY5JzhaGMduny\",\n              \"name\": \"Telegram account\"\n            }\n          }\n        },\n        {\n          \"parameters\": {\n            \"operation\": \"binaryToPropery\",\n            \"options\": {}\n          },\n          \"type\": \"n8n-nodes-base.extractFromFile\",\n          \"typeVersion\": 1,\n          \"position\": [\n            256,\n            496\n          ],\n          \"id\": \"dba917dc-c115-4353-84e4-ecc713e4b632\",\n          \"name\": \"Extract from File\"\n        },\n        {\n          \"parameters\": {\n            \"descriptionType\": \"manual\",\n            \"toolDescription\": \"Send a text message in Telegram - use this for intermediate tool updates, like sharing what you're going to do next. Do not use this for asking questions. You won't receive responses.\",\n            \"chatId\": \"={{ $('set user and chat id').item.json.telegram_user_id }}\",\n            \"text\": \"=Tussentjdse update: {{ $fromAI('Text', `The update message to give to the user`, 'string') }}\",\n            \"additionalFields\": {\n              \"appendAttribution\": false\n            }\n          },\n          \"type\": \"n8n-nodes-base.telegramTool\",\n          \"typeVersion\": 1.2,\n          \"position\": [\n            1888,\n            1152\n          ],\n          \"id\": \"e4b0b82c-9bbf-44ee-aa79-06862c47332a\",\n          \"name\": \"Send a text message in Telegram\",\n          \"webhookId\": \"416eb659-8221-4f4a-b2d3-38e6a1cba872\",\n          \"credentials\": {\n            \"telegramApi\": {\n              \"id\": \"TBAkY5JzhaGMduny\",\n              \"name\": \"Telegram account\"\n            }\n          }\n        },\n        {\n          \"parameters\": {\n            \"workflowId\": {\n              \"__rl\": true,\n              \"mode\": \"id\",\n              \"value\": \"DSqYc1jqBgJcOlWZ\"\n            },\n            \"workflowInputs\": {\n              \"mappingMode\": \"defineBelow\",\n              \"value\": {\n                \"message_chat_id\": \"={{ $('Telegram Trigger').item.json.message.chat.id }}\"\n              },\n              \"matchingColumns\": [\n                \"message_chat_id\"\n              ],\n              \"schema\": [\n                {\n                  \"id\": \"message_chat_id\",\n                  \"displayName\": \"message_chat_id\",\n                  \"required\": false,\n                  \"defaultMatch\": false,\n                  \"display\": true,\n                  \"canBeUsedToMatch\": true,\n                  \"removed\": false\n                }\n              ],\n              \"attemptToConvertTypes\": false,\n              \"convertFieldsToString\": true\n            },\n            \"options\": {\n              \"waitForSubWorkflow\": false\n            }\n          },\n          \"type\": \"n8n-nodes-base.executeWorkflow\",\n          \"typeVersion\": 1.2,\n          \"position\": [\n            0,\n            0\n          ],\n          \"name\": \"Call [JJ] send typing notification\",\n          \"id\": \"fe3f4e7d-1603-4b3a-8a3e-9b3ccf4ff770\"\n        },\n        {\n          \"parameters\": {\n            \"description\": \"Use the tool to think about something. It will not obtain new information or change the database, but just append the thought to the log. Use it at the start of EVERY response.\"\n          },\n          \"type\": \"@n8n/n8n-nodes-langchain.toolThink\",\n          \"typeVersion\": 1,\n          \"position\": [\n            1632,\n            976\n          ],\n          \"id\": \"4b825c6a-8de6-41ed-99f3-b59285aa0c50\",\n          \"name\": \"Think\"\n        },\n        {\n          \"parameters\": {\n            \"httpMethod\": \"POST\",\n            \"path\": \"3f3f605d-0e73-4781-9959-41643c83c6ad\",\n            \"options\": {}\n          },\n          \"type\": \"n8n-nodes-base.webhook\",\n          \"typeVersion\": 2,\n          \"position\": [\n            -400,\n            784\n          ],\n          \"id\": \"7cc3376a-ea1b-43cf-8efc-4e34c63da4ec\",\n          \"name\": \"Webhook\",\n          \"webhookId\": \"3f3f605d-0e73-4781-9959-41643c83c6ad\"\n        },\n        {\n          \"parameters\": {\n            \"assignments\": {\n              \"assignments\": [\n                {\n                  \"id\": \"3e4c4ce4-d877-49d7-a5f6-6b84c391c7a3\",\n                  \"name\": \"prompt\",\n                  \"value\": \"=<audiomessage>{{ $json.text }}</audiomessage>\",\n                  \"type\": \"string\"\n                }\n              ]\n            },\n            \"includeOtherFields\": true,\n            \"options\": {}\n          },\n          \"type\": \"n8n-nodes-base.set\",\n          \"typeVersion\": 3.4,\n          \"position\": [\n            560,\n            224\n          ],\n          \"id\": \"ae524854-a40d-4fb5-a009-c1d146a3c4db\",\n          \"name\": \"Set prompt - audio\"\n        },\n        {\n          \"parameters\": {\n            \"assignments\": {\n              \"assignments\": [\n                {\n                  \"id\": \"097c214f-ed27-4720-b65a-f034e9aa098e\",\n                  \"name\": \"prompt\",\n                  \"value\": \"=User uploaded an image. Use Query image tool to ask questions. <image_id={{ $json.data.image.id }}><description>{{ $json.data.image.description }}</description><.image_id={{ $json.data.image.id }}> \\n\\n{{ $('Telegram Trigger').item.json.message.caption }}\",\n                  \"type\": \"string\"\n                }\n              ]\n            },\n            \"includeOtherFields\": true,\n            \"options\": {}\n          },\n          \"type\": \"n8n-nodes-base.set\",\n          \"typeVersion\": 3.4,\n          \"position\": [\n            560,\n            496\n          ],\n          \"id\": \"08e3e16e-e933-4d01-8a14-c903d66ef62d\",\n          \"name\": \"Set prompt - image\"\n        },\n        {\n          \"parameters\": {\n            \"assignments\": {\n              \"assignments\": [\n                {\n                  \"id\": \"0cedc958-4628-45af-9e18-e91d6fc33675\",\n                  \"name\": \"prompt\",\n                  \"value\": \"={{ $json.message.text }}\",\n                  \"type\": \"string\"\n                }\n              ]\n            },\n            \"includeOtherFields\": true,\n            \"options\": {}\n          },\n          \"type\": \"n8n-nodes-base.set\",\n          \"typeVersion\": 3.4,\n          \"position\": [\n            560,\n            368\n          ],\n          \"id\": \"5c878a7f-08de-4b97-a7a8-071bad92730c\",\n          \"name\": \"Set prompt - text\"\n        },\n        {\n          \"parameters\": {\n            \"assignments\": {\n              \"assignments\": [\n                {\n                  \"id\": \"869e6d89-1522-443c-b699-c152a4071bb2\",\n                  \"name\": \"telegram_user_id\",\n                  \"value\": \"={{ $json.message?.from?.id || $json.telegram_user_id || 'xxx' }}\",\n                  \"type\": \"string\"\n                },\n                {\n                  \"id\": \"d5789dd3-c19c-4520-b5e6-c6452e2f58a3\",\n                  \"name\": \"=telegram_chat_id\",\n                  \"value\": \"={{ $json.message?.from?.id || $json.telegram_user_id || 'xxx' }}\",\n                  \"type\": \"string\"\n                },\n                {\n                  \"id\": \"f919205a-0cc1-4b7d-a0bc-3cef28726069\",\n                  \"name\": \"message_id\",\n                  \"value\": \"={{ $json.message.message_id }}\",\n                  \"type\": \"number\"\n                }\n              ]\n            },\n            \"includeOtherFields\": true,\n            \"options\": {}\n          },\n          \"type\": \"n8n-nodes-base.set\",\n          \"typeVersion\": 3.4,\n          \"position\": [\n            1024,\n            384\n          ],\n          \"id\": \"1175b6d8-922b-4d60-b588-740dd62ad11f\",\n          \"name\": \"set user and chat id\"\n        },\n        {\n          \"parameters\": {\n            \"assignments\": {\n              \"assignments\": [\n                {\n                  \"id\": \"a52ee760-37d8-4185-873e-b823b5432586\",\n                  \"name\": \"prompt\",\n                  \"value\": \"=This is message send automatically through a scheduled message with task_id: {{ $json.body.task_id }}\\n\\nMessage:\\n\\n{{ $json.body.message }}\",\n                  \"type\": \"string\"\n                },\n                {\n                  \"id\": \"329c939f-aa37-41e8-97ae-3122581715f9\",\n                  \"name\": \"telegram_user_id\",\n                  \"value\": \"={{ $json.body.telegram_user_id }}\",\n                  \"type\": \"string\"\n                },\n                {\n                  \"id\": \"29ef9a10-1c0c-493f-97a0-87b7d5713ff5\",\n                  \"name\": \"telegram_chat_id\",\n                  \"value\": \"={{ $json.body.telegram_user_id }}\",\n                  \"type\": \"string\"\n                },\n                {\n                  \"id\": \"9bf62e55-3b23-44d2-8a24-00843ac4b783\",\n                  \"name\": \"message_id\",\n                  \"value\": \"={{ Math.floor(Math.random() * (1000000 - 10000 + 1)) + 10000 }}\",\n                  \"type\": \"number\"\n                }\n              ]\n            },\n            \"options\": {}\n          },\n          \"type\": \"n8n-nodes-base.set\",\n          \"typeVersion\": 3.4,\n          \"position\": [\n            560,\n            784\n          ],\n          \"id\": \"ed5a6251-18a4-42bd-9fd7-c0bb27e09b9d\",\n          \"name\": \"Edit Fields1\"\n        },\n        {\n          \"parameters\": {\n            \"workflowId\": {\n              \"__rl\": true,\n              \"mode\": \"id\",\n              \"value\": \"dNwrDxSeiaUdLipY\"\n            },\n            \"workflowInputs\": {\n              \"mappingMode\": \"defineBelow\",\n              \"value\": {\n                \"user_telegram_id\": \"={{ String($('Telegram Trigger').item.json.message.from.id) }}\",\n                \"chat_telegram_id\": \"={{ String($('Telegram Trigger').item.json.message.chat.id) }}\",\n                \"message_id\": \"={{ $('Telegram Trigger').item.json.message.date }}\",\n                \"file_id\": \"={{ $('Telegram Trigger').item.json.message.photo[3].file_id }}\",\n                \"caption\": \"={{ $('Telegram Trigger').item.json.message.caption }}\",\n                \"file_content\": \"={{ $json.data }}\"\n              },\n              \"matchingColumns\": [],\n              \"schema\": [\n                {\n                  \"id\": \"user_telegram_id\",\n                  \"displayName\": \"user_telegram_id\",\n                  \"required\": false,\n                  \"defaultMatch\": false,\n                  \"display\": true,\n                  \"canBeUsedToMatch\": true,\n                  \"type\": \"string\"\n                },\n                {\n                  \"id\": \"chat_telegram_id\",\n                  \"displayName\": \"chat_telegram_id\",\n                  \"required\": false,\n                  \"defaultMatch\": false,\n                  \"display\": true,\n                  \"canBeUsedToMatch\": true,\n                  \"type\": \"string\"\n                },\n                {\n                  \"id\": \"message_id\",\n                  \"displayName\": \"message_id\",\n                  \"required\": false,\n                  \"defaultMatch\": false,\n                  \"display\": true,\n                  \"canBeUsedToMatch\": true,\n                  \"type\": \"number\"\n                },\n                {\n                  \"id\": \"file_id\",\n                  \"displayName\": \"file_id\",\n                  \"required\": false,\n                  \"defaultMatch\": false,\n                  \"display\": true,\n                  \"canBeUsedToMatch\": true,\n                  \"type\": \"string\"\n                },\n                {\n                  \"id\": \"file_content\",\n                  \"displayName\": \"file_content\",\n                  \"required\": false,\n                  \"defaultMatch\": false,\n                  \"display\": true,\n                  \"canBeUsedToMatch\": true,\n                  \"type\": \"string\",\n                  \"removed\": false\n                },\n                {\n                  \"id\": \"caption\",\n                  \"displayName\": \"caption\",\n                  \"required\": false,\n                  \"defaultMatch\": false,\n                  \"display\": true,\n                  \"canBeUsedToMatch\": true,\n                  \"type\": \"string\"\n                }\n              ],\n              \"attemptToConvertTypes\": false,\n              \"convertFieldsToString\": true\n            },\n            \"options\": {}\n          },\n          \"type\": \"n8n-nodes-base.executeWorkflow\",\n          \"typeVersion\": 1.2,\n          \"position\": [\n            400,\n            496\n          ],\n          \"id\": \"d0be06f2-1ed2-4485-aee2-16b15e06e920\",\n          \"name\": \"Call '[JJ] Image Tool'\"\n        },\n        {\n          \"parameters\": {\n            \"model\": {\n              \"__rl\": true,\n              \"value\": \"gpt-5-mini\",\n              \"mode\": \"list\",\n              \"cachedResultName\": \"gpt-5-mini\"\n            },\n            \"options\": {}\n          },\n          \"type\": \"@n8n/n8n-nodes-langchain.lmChatOpenAi\",\n          \"typeVersion\": 1.2,\n          \"position\": [\n            1056,\n            608\n          ],\n          \"id\": \"b2b4ad99-95f0-483f-95c5-724344aad1c3\",\n          \"name\": \"OpenAI Chat Model\",\n          \"credentials\": {\n            \"openAiApi\": {\n              \"id\": \"224l8PKoMiKAr2Bc\",\n              \"name\": \"OpenAi account\"\n            }\n          }\n        },\n        {\n          \"parameters\": {\n            \"workflowId\": {\n              \"__rl\": true,\n              \"mode\": \"id\",\n              \"value\": \"SGUwY3pSYRUChIqK\"\n            },\n            \"workflowInputs\": {\n              \"mappingMode\": \"defineBelow\",\n              \"value\": {},\n              \"matchingColumns\": [],\n              \"schema\": [],\n              \"attemptToConvertTypes\": false,\n              \"convertFieldsToString\": true\n            },\n            \"options\": {\n              \"waitForSubWorkflow\": true\n            }\n          },\n          \"type\": \"n8n-nodes-base.executeWorkflow\",\n          \"typeVersion\": 1.2,\n          \"position\": [\n            2272,\n            608\n          ],\n          \"id\": \"c4ffb304-9f53-4d35-a1ec-432f047ead33\",\n          \"name\": \"Send Telegram Message\"\n        }\n      ],\n      \"connections\": {\n        \"Telegram Trigger\": {\n          \"main\": [\n            [\n              {\n                \"node\": \"Switch\",\n                \"type\": \"main\",\n                \"index\": 0\n              },\n              {\n                \"node\": \"Call [JJ] send typing notification\",\n                \"type\": \"main\",\n                \"index\": 0\n              }\n            ]\n          ]\n        },\n        \"Simple Memory\": {\n          \"ai_memory\": [\n            [\n              {\n                \"node\": \"AI Agent\",\n                \"type\": \"ai_memory\",\n                \"index\": 0\n              }\n            ]\n          ]\n        },\n        \"AI Agent\": {\n          \"main\": [\n            [\n              {\n                \"node\": \"Store bot message\",\n                \"type\": \"main\",\n                \"index\": 0\n              },\n              {\n                \"node\": \"Store user message\",\n                \"type\": \"main\",\n                \"index\": 0\n              },\n              {\n                \"node\": \"Edit Fields\",\n                \"type\": \"main\",\n                \"index\": 0\n              }\n            ]\n          ]\n        },\n        \"CRUD NOTES\": {\n          \"ai_tool\": [\n            [\n              {\n                \"node\": \"AI Agent\",\n                \"type\": \"ai_tool\",\n                \"index\": 0\n              }\n            ]\n          ]\n        },\n        \"Search Memory Tool\": {\n          \"ai_tool\": [\n            [\n              {\n                \"node\": \"AI Agent\",\n                \"type\": \"ai_tool\",\n                \"index\": 0\n              }\n            ]\n          ]\n        },\n        \"Store a contact\": {\n          \"ai_tool\": [\n            [\n              {\n                \"node\": \"AI Agent\",\n                \"type\": \"ai_tool\",\n                \"index\": 0\n              }\n            ]\n          ]\n        },\n        \"QUERY IMAGE\": {\n          \"ai_tool\": [\n            [\n              {\n                \"node\": \"AI Agent\",\n                \"type\": \"ai_tool\",\n                \"index\": 0\n              }\n            ]\n          ]\n        },\n        \"Manage Tags\": {\n          \"ai_tool\": [\n            [\n              {\n                \"node\": \"AI Agent\",\n                \"type\": \"ai_tool\",\n                \"index\": 0\n              }\n            ]\n          ]\n        },\n        \"Manage Scheduled Tasks\": {\n          \"ai_tool\": [\n            [\n              {\n                \"node\": \"AI Agent\",\n                \"type\": \"ai_tool\",\n                \"index\": 0\n              }\n            ]\n          ]\n        },\n        \"Edit Fields\": {\n          \"main\": [\n            [\n              {\n                \"node\": \"Send Telegram Message\",\n                \"type\": \"main\",\n                \"index\": 0\n              }\n            ]\n          ]\n        },\n        \"Switch\": {\n          \"main\": [\n            [\n              {\n                \"node\": \"Download audio file\",\n                \"type\": \"main\",\n                \"index\": 0\n              }\n            ],\n            [\n              {\n                \"node\": \"Set prompt - text\",\n                \"type\": \"main\",\n                \"index\": 0\n              }\n            ],\n            [\n              {\n                \"node\": \"Download image\",\n                \"type\": \"main\",\n                \"index\": 0\n              }\n            ]\n          ]\n        },\n        \"Download audio file\": {\n          \"main\": [\n            [\n              {\n                \"node\": \"Transcribe a recording\",\n                \"type\": \"main\",\n                \"index\": 0\n              }\n            ]\n          ]\n        },\n        \"Download image\": {\n          \"main\": [\n            [\n              {\n                \"node\": \"Extract from File\",\n                \"type\": \"main\",\n                \"index\": 0\n              }\n            ]\n          ]\n        },\n        \"Transcribe a recording\": {\n          \"main\": [\n            [\n              {\n                \"node\": \"Set prompt - audio\",\n                \"type\": \"main\",\n                \"index\": 0\n              }\n            ]\n          ]\n        },\n        \"Extract from File\": {\n          \"main\": [\n            [\n              {\n                \"node\": \"Call '[JJ] Image Tool'\",\n                \"type\": \"main\",\n                \"index\": 0\n              }\n            ]\n          ]\n        },\n        \"Send a text message in Telegram\": {\n          \"ai_tool\": [\n            [\n              {\n                \"node\": \"AI Agent\",\n                \"type\": \"ai_tool\",\n                \"index\": 0\n              }\n            ]\n          ]\n        },\n        \"Think\": {\n          \"ai_tool\": [\n            [\n              {\n                \"node\": \"AI Agent\",\n                \"type\": \"ai_tool\",\n                \"index\": 0\n              }\n            ]\n          ]\n        },\n        \"Set prompt - audio\": {\n          \"main\": [\n            [\n              {\n                \"node\": \"set user and chat id\",\n                \"type\": \"main\",\n                \"index\": 0\n              }\n            ]\n          ]\n        },\n        \"Set prompt - image\": {\n          \"main\": [\n            [\n              {\n                \"node\": \"set user and chat id\",\n                \"type\": \"main\",\n                \"index\": 0\n              }\n            ]\n          ]\n        },\n        \"Set prompt - text\": {\n          \"main\": [\n            [\n              {\n                \"node\": \"set user and chat id\",\n                \"type\": \"main\",\n                \"index\": 0\n              }\n            ]\n          ]\n        },\n        \"Webhook\": {\n          \"main\": [\n            [\n              {\n                \"node\": \"Edit Fields1\",\n                \"type\": \"main\",\n                \"index\": 0\n              }\n            ]\n          ]\n        },\n        \"set user and chat id\": {\n          \"main\": [\n            [\n              {\n                \"node\": \"AI Agent\",\n                \"type\": \"main\",\n                \"index\": 0\n              }\n            ]\n          ]\n        },\n        \"Edit Fields1\": {\n          \"main\": [\n            [\n              {\n                \"node\": \"set user and chat id\",\n                \"type\": \"main\",\n                \"index\": 0\n              }\n            ]\n          ]\n        },\n        \"Call '[JJ] Image Tool'\": {\n          \"main\": [\n            [\n              {\n                \"node\": \"Set prompt - image\",\n                \"type\": \"main\",\n                \"index\": 0\n              }\n            ]\n          ]\n        },\n        \"OpenAI Chat Model\": {\n          \"ai_languageModel\": [\n            [\n              {\n                \"node\": \"AI Agent\",\n                \"type\": \"ai_languageModel\",\n                \"index\": 0\n              }\n            ]\n          ]\n        }\n      },\n      \"authors\": \"system migration\",\n      \"name\": null,\n      \"description\": null,\n      \"autosaved\": false,\n      \"workflowPublishHistory\": [\n        {\n          \"createdAt\": \"2025-09-10T08:26:19.000Z\",\n          \"id\": 11,\n          \"workflowId\": \"l1RWUMPJ1x6logZP\",\n          \"versionId\": \"26a290b0-afe2-4d5a-80ed-dd7f09c489d5\",\n          \"event\": \"activated\",\n          \"userId\": null\n        }\n      ]\n    }\n  }\n}"
  }
]